{"posts":[{"id":"172338516139198_1346297195409985","from":{"name":"Ahmed El Gabri","id":"10158299136875582"},"message":"This is why the future of JavaScript is to be a compilation target.","caption":"medium.com","description":"So you are intrigued what WebAssembly is and want to try it? Since December 22 it’s possible to compile Rust to WASM. If you don’t know…","created_time":"2017-01-06T00:35:08+11:00","total_likes":2,"total_comments":0},{"id":"172338516139198_1346148115424893","from":{"name":"Mohamed Abdel Aty","id":"10212491964880718"},"message":"Anyone still having problem with google using https on windows in Egypt? I just tried something and worked for me\n\nMove the \"equifax secure certificate authority\" from the trusted root certification authorities to untrusted certificates in windows cert manager\n\nonly the pc i did this on had google working again on https with no warnings from chrome \n\ncan anyone confirm this solution work ? if it did not you can revert this by moving the certificates back to rusted root certification authorities","caption":null,"description":null,"created_time":"2017-01-05T20:30:49+11:00","total_likes":6,"total_comments":4},{"id":"172338516139198_1346246935415011","from":{"name":"Waleed Rostom","id":"10155013782967114"},"message":"A React-like JS library that is, according to them, a much smaller (9kb vs 45kb) and much faster alternative to React.","caption":"infernojs.org","description":null,"created_time":"2017-01-05T23:50:17+11:00","total_likes":5,"total_comments":2},{"id":"172338516139198_1346514582054913","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":"Product Design Course Powered by Uber","caption":"2020shift.com","description":"In this part-time course, students will learn the fundamentals of product management, roadmapping, prototyping, and basic UX/UI design. Students will work on an intensive client brief from UBER and have the opportunity to walk away with a tangible project that can be used in their portfolio . This c...","created_time":"2017-01-06T05:11:34+11:00","total_likes":4,"total_comments":0},{"id":"172338516139198_1346519228721115","from":{"name":"Ahmad Alfy","id":"10154097389365670"},"message":"Facebook Open Source program published their 2016 year in review. With more than 13,000 pull requests from 2,700 external contributors.","caption":"code.facebook.com","description":"Over the past few years, Facebook's Open Source program has grown into one of the largest and most active portfolios in the industry.","created_time":"2017-01-06T05:16:33+11:00","total_likes":9,"total_comments":0},{"id":"172338516139198_1345509402155431","from":{"name":"MohAmed HAmada","id":"734288583412841"},"message":"السلام عليكم \nهل ف طريقه اقدر امنع بيها الداونلود مانجر انه يحمل فيديو \nالعميل رافض ان الفيديو يتحمل \nان شلت علامة الداونلود اللي بتظهر ع الفيديو و منعت ال Right Click عليه \nلكن بمجرد ان الفيديو يحصله Load ع الصفحة  علامة الدونلود مانجر بتظهر و بيقدر يحمل الفيديو كامل بسهولة جداً \nاو ع الأقل اقدر اخفي علامة ال IDM","caption":null,"description":null,"created_time":"2017-01-05T03:35:29+11:00","total_likes":2,"total_comments":15},{"id":"172338516139198_1345633615476343","from":{"name":"أحمد بلال","id":"703712466457163"},"message":"www.google.com.eg didn't work with me now, it gives \"Secure Connection Failed\"\nI tried other countries like Canada, it works well.\nAnyone know any idea about this problem and how to fix it?","caption":null,"description":null,"created_time":"2017-01-05T06:20:54+11:00","total_likes":2,"total_comments":12},{"id":"172338516139198_1346112955428409","from":{"name":"Muhammad Bassem","id":"10209993936899469"},"message":"فقرة Today I Learned\n\nمؤخرا كنت بخبط كتير في commands بتاخد في الarguments بتاعتها \"--\" كدة من غير أي إسم أو حاجة. قعدت فترة بشوفها و بحس إن ملهاش لازمة و مش عارف حتى إسمها علشان أعرف أ Google it. لحد ما خبط في كذا حاجة كانت هي حلهم.\n\n١- كنت بجرب framework فا بكتب \"revel new --help\" فا بكل غباء قامت عاملالي directory إسمها \"--help\". بديهيا بمسحها فا بكتب \"rm -r --help\" و بعد ما كتبتها حسيت إن بديهيا ده مش هيشتغل. فا ببص على الman بتاع rm لقيت :\n\"The rm command uses getopt(3) to parse its arguments, which allows it to accept the `--' option which will cause it to stop processing flag options at that point.  This will allow the removal of file names that begin with a dash (`-').  For example: rm -- -filename\"\n\n٢- كنت بستخدم build tool إسمها bazel فا من ضمن الcommands فيه اللي بيrun الproject بتاعك \"bazel run <project> <args>\" و المفروض الargs ديه تروح للproject مش لbazel لكن العكس هو اللي كان بيحصل لحد ما \"--\" كانت الحل برضة.\n\nTL;DR : http://unix.stackexchange.com/questions/11376/what-does-double-dash-mean-also-known-as-bare-double-dash","caption":null,"description":null,"created_time":"2017-01-05T20:06:40+11:00","total_likes":19,"total_comments":2},{"id":"172338516139198_1345323108840727","from":{"name":"Osama Soliman","id":"709206249239999"},"message":"ايه الطريقة الصحيحة اللي ممكن اسأل بيها على Stackoverflow ؟\n*اللي حصل* \nسألت سؤال هناك ازاي اجمع عددين بدون استخدام + او - في جافاسكريبت خدت downvotes حوالي -9 وكمان خدت بان اني اسأل تاني لحد اما أخد upvotes اكتر من اللي خسرتهم :( !","caption":null,"description":null,"created_time":"2017-01-04T22:52:57+11:00","total_likes":6,"total_comments":22},{"id":"172338516139198_1346598225379882","from":{"name":"Ahmed Saleh","id":"10158326787715574"},"message":"So I'm trying to solve a problem. I have a point which can be a player, and I have several objects around, some are farther some are near er. I want to exclude all points that are farther and include the nearer using distances for example. How would one cluster or filter the objects. I'm thinking about spatial partitioning. The objects are in geographic coordinates. The number of objects can be 10.000","caption":null,"description":null,"created_time":"2017-01-06T07:10:58+11:00","total_likes":2,"total_comments":0}]}