{"posts":[{"id":"172338516139198_862073727165670","from":{"name":"Yehya Hafez","id":"1814037031955164"},"message":"Some of them are really new to me!","caption":"arageek.com","description":"جوجل يقدم أكثر بكثير من مجرد البحث.. ستجعلك هذه الميزات تُحِب جوجل أكثر مما تتوقّع","created_time":"2014-12-16T22:17:20+11:00","total_likes":1,"total_comments":1},{"id":"172338516139198_862223000484076","from":{"name":"Yassein Bilal","id":"10209161695061203"},"message":"Your app should take sides\n\n","caption":"gettingreal.37signals.com","description":"Some people argue software should be agnostic. They say it's arrogant for developers to limit features or ignore feature requests. They say software should always be as flexible as possible.","created_time":"2014-12-17T05:33:00+11:00","total_likes":0,"total_comments":0},{"id":"172338516139198_861261263913583","from":{"name":"AbdAllah Khashaba","id":"850869651733894"},"message":"what are paypal alternatives for you guys ?","caption":null,"description":null,"created_time":"2014-12-15T14:33:11+11:00","total_likes":1,"total_comments":12},{"id":"172338516139198_862614227111620","from":{"name":"Mostafa Muhammad","id":"10154873940166210"},"message":"Does anybody know of companies operating in Egypt that can customize, deploy and support a Moodle system for a medical college in Cairo? The project might entail provision of hardware and infrastructure for a 100-machine computer lab.\n\nThis is not exactly a job posting but it borders on being one. so I apologize if this is ,indeed , an out-of-place post","caption":null,"description":null,"created_time":"2014-12-18T02:09:46+11:00","total_likes":0,"total_comments":5},{"id":"172338516139198_862560723783637","from":{"name":"Salah Jr Ahmed","id":"10154647662667880"},"message":"I have a problem that over my website I use a SSL certificate .. sometimes on some PCs or mobile devices using chrome he asks to select SSL certificate .. Can anyone tell me how to solve this ?!","caption":null,"description":null,"created_time":"2014-12-17T23:45:12+11:00","total_likes":0,"total_comments":10},{"id":"172338516139198_862517610454615","from":{"name":"Tarek Omar","id":"10158398543535224"},"message":"Can anyone provide me with reliable bulk sms service with a reliable API,\n\nThanks","caption":null,"description":null,"created_time":"2014-12-17T22:07:01+11:00","total_likes":3,"total_comments":7},{"id":"172338516139198_862361197136923","from":{"name":"Meligy","id":"10154884040385170"},"message":null,"caption":"readysetstartup.com","description":"If I could recommend only 5 books for every entrepreneur to read, these would be the ones. They’ve had a massive impact not only on my businesses, but my life. So in the Spirit of Christmas, I want to share them with you. This is the essential reading list you can win: Learned Optimism by Martin Sel…","created_time":"2014-12-17T11:53:55+11:00","total_likes":1,"total_comments":1},{"id":"172338516139198_861586293881080","from":{"name":"Mohamed Samy","id":"10158821643510355"},"message":"Have any of you geeks every tried to run a VM off a Ramdisk? I ould really be interested in hearing you experience.","caption":null,"description":null,"created_time":"2014-12-16T02:02:11+11:00","total_likes":0,"total_comments":4},{"id":"172338516139198_863561540350222","from":{"name":"AbdAllah Khashaba","id":"850869651733894"},"message":"The last geek in Egypt :)\n","caption":"youtube.com","description":"اشترك الآن لمشاهدة فيديوهات أكتر: http://goo.gl/CmFmR لمشاهدة أجدد الحلقات ادخل على: http://elgtv.com تابعنا على الفيس بوك: https://facebook.com/elgtv تابعنا...","created_time":"2014-12-19T16:19:53+11:00","total_likes":0,"total_comments":0},{"id":"172338516139198_863271953712514","from":{"name":"Mohamed Samy","id":"10158821643510355"},"message":"A funny story:\n\nTrue story:\n\nCEO:\nMohamed, We just discovered that the deadline for the project is next Sunday for the first module to be delivered.\n\nME:\nWhat do you mean discovered? How on earth are we supposed to deliver something to the customer on Sunday, when today is Wednesday night.\n\nCEO:\nI am depending on you, I am sorry we have no other choice.\n\nME:\nWe haven't even done requirements gathering. What are we even supposed to develop.\n\nCEO:\nYou know they want an ERP.\n\nME:\nExcuse me? we have 3 days to deliver something, exactly what part of the ERP could we possibly deliver in that time from scratch?\n\nCEO:\nStart with inventory, cause the customer is expecting to open a new warehouse on Sunday.\n\nME:\nBut we have no idea what his requirements are, no stakeholders, and not a single document even vaguely explaining the requirements.\n\nCEO (Accusingly):\nDocument? Didn't you read the proposal? I sent it to you a week ago.\n\nME:\nYou mean the 7 page document that said that the business requirements were going to be \"generic and configurable\"?\n\nCEO:\nYes, we can use a workflow and implement any business logic we want.\n\nME:\nSo what business logic are we required to deliver Sunday?\n\nCEO:\nThe inventory management module\n\nME:\nYeah, exactly what possible functionality can we do in 3 days including the weekend.\n\nCEO:\nMohamed, this is exactly the type of attitude I was warned about by the CIO. He says your ideas are too \"theoretical\" and that you should just start writing code and worry about the requirements later.\n\nME:\nAre you really being serious? How on earth do we develop something we haven't even agreed on?\n\nCEO:\nJust do, Inventory In and out and a report to show the inventory.\n\nME:\nWhat about returns? And who said inventory is just in and out?\n\nCEO:\nInventory is easy.\n\nME:\nNo, Inventory is very complicated business, in fact it is a science. Didn't you read the big inventory book in your business school?\n\nCEO:\nDon't worry, the business here is simple, and we don't need any \"returns\"\n\nME:\nThat is just impossible.\n\nCEO:\nYou know what? I will solve the whole problem now?\n\nME:\nHow?\n\nCEO:\nWe built an ERP system for a dairy producer 5 years ago, you can just use the inventory module from there and deploy it to the customer.\n\nME:\nFirstly, that was 5 years ago in Visual Basic. The customer wants an ASP.NET web portal.\n\nSecondly, The \"ERP\" does dairy, this is construction material.\n\nCEO:\nWhat is the difference? See, you already complain without even knowing the whole story. Your main problem is that you are too rash and not tactful.\n\nME:\nSo who can explain to me how a dairy ERP can work at a cement factory?\n\nCEO:\nThe business analyst.\n\nME:\nAnd what about the code.\n\nCEO:\nI think we have it backed up somewhere. You understand the business and figure out how to use the system. Then read the code and understand it and figure out the changes you need to make.\n\nME:\nBut the customer is waiting for a system built with ASP.NET, how do I deliver a system in Visual Basic windows forms? even if we forget about the business?\n\nCEO:\nUse the system as a backend and build a new front end. I am guessing this will save you a lot of time.\n\nSee , when you think business and get out of your technical bubble you can actually get stuff done.\n\nI leave the rest of the story to your imagination :)","caption":null,"description":null,"created_time":"2014-12-19T02:53:22+11:00","total_likes":25,"total_comments":25}]}