{"posts":[{"id":"172338516139198_1026808524025522","from":{"name":"Muhammad El-Hennawy","id":"10210432517001560"},"message":"Hello Geeks, I know my question seems repetitive but I am getting interesting to work in freelancing. I am Android Developer comes from Web development (PHP basically). I haven't done any freelancing jobs before and I would like to know HOW and WHERE I can start.\n\nI would like to know:\n\nHow to find freelancing jobs (potential customers)?\nHow can you get paid for your work (payment methods) and on which basis (e.g, hourly or fixed price)?\nHow can you build reputation and marketing your self?\n\nAny more advice or tips I will be so grateful.\n\nThanks in andvance, cheers :)","caption":null,"description":null,"created_time":"2015-11-02T01:36:19+11:00","total_likes":1,"total_comments":4},{"id":"172338516139198_1026923487347359","from":{"name":"Abdullah El-menawy","id":"10202808632734302"},"message":"Hello folks,\nI'm trying to make a web service to help make a live video stream between multiple mobile devices (Android and iOS) using the same application (something like google hangout video)\nwell, I don't know how to begin or what to do. I tried searching a lot but I couldn't understand anything. I found something called Kickflip \n(https://kickflip.io/)\nbut I couldn't understand its mechanism.\nthe question here is : what is the mechanism of something like this to be developed as a web service ?\nAny suggestions for a library for this for Android and iOS ?\n\nNote : web service is developed using ASP.NET Web API","caption":"kickflip.io","description":"Kickflip is a revolution in mobile video broadcasting. For the first time ever, any application can have high definition, live video broadcasting.","created_time":"2015-11-02T06:37:06+11:00","total_likes":2,"total_comments":0},{"id":"172338516139198_1026951437344564","from":{"name":"Hisham Hassan","id":"10155120512779187"},"message":"I want your feedback about my app \"Tabe3\". I don't know If this post is violating rules. If it is, please remove it.\n\nhttps://play.google.com/store/apps/details?id=com.tabe3.news\n\nTabe3 - \"Follow\" in Arabic - is an Arabic news reader app that starts from where others end. \n\nIt lets you follow latest news from various fields: politics, sports, technology, entrepreneurship, economy, women, cooking, cars, travel, tourism and economy.\n\nAlso you can follow latest news from various countries: Egypt, Saudi Arabia, UAE, Kuwait, Lebanon, Jordan, Bahrain, Oman, Yemen, Tunisia, Morocco, Algeria , Iraq , Sudan, Palestine, Qatar, Syria and Libya\n\nAlthough it is in its first version, but it has a lot of competetive features. More Major features to come in coming updates\n\nCurrent version features:\n\n- Just follow your favorite sources. Choose from hundreds of available sources.\n\n- No more Internet. Save a copy of the news and read it later without Internet.\n\n- No more loss of preferences. Log in using Facebook or Twitter or email to save your preferences online, you still can use the application without login.\n\n- You will receive a notification when there is breaking news from your favorite sources only. You can stop the notification feature.\n\n- You can add a comment to the news.\n\n- You can favorite news.\n\n- You can share news with various social networks.\n\n- You can search for news\n\n- App is following latest Google tips & tricks in terms of beauty of user interface, ease of use, reducing Internet connection and saving battery.\n\nApp Page on Google Play: https://play.google.com/store/apps/details?id=com.tabe3.news\nVideo for the app: https://www.youtube.com/watch?v=Q8NQ_Ss4Kvs\n\nWebsites wrote reviews about app:\nArdroid: http://bit.ly/1XcVN8G\nhttp://tech-echo.com/2015/10/tabe3-news-reader/\nhttp://www.navydroid.com/2015/10/tabe3-news-app.html","caption":null,"description":null,"created_time":"2015-11-02T08:16:07+11:00","total_likes":5,"total_comments":0},{"id":"172338516139198_1027145483991826","from":{"name":"Hisham Abd El-Hafez Eid","id":"10155080508766171"},"message":"Big O cheat sheet\n","caption":"bigocheatsheet.com","description":"Hi there!  This webpage covers the space and time Big-O complexities of common algorithms used in Computer Science.  When preparing for technical interviews in the past, I found myself spending hours crawling the internet putting together the best, average, and worst case complexities for search and…","created_time":"2015-11-02T21:22:02+11:00","total_likes":18,"total_comments":1},{"id":"172338516139198_1027240210649020","from":{"name":"Michael Henry","id":"10155149755210955"},"message":"Not a Good News, our website www.kenrys.com got hacked and we managed to clean it.\n\nHere is the issue for all of you guys to take care:\n\nCheck your wordpress website for the following:\n1- Installed Plugin called \"SEO Advisor\"\n2- In the plugins directory, any strange plugin folder like \"Wordpress Researchers\" or other not identified names.\n3- Strange Tables in the WP DB like \"wp_cont, wp_core_log\"\n4- Check your users and if there is any user added.\n5- New posts published under you website and they will not appear under posts section in the Dashboard.\n\nto make sure just do a search on google for all indexed urls example: \"site:kenrys.com\"\n\nIf you found anything from the above, then your website got hacked.\n\nTo clean it you have to do the following steps:\n\n1- Take a backup (yes from the infected website, you might lose all content during the cleaning process - from database & files).\n\n2- Remove all unwanted plugins (mentioned above), you might end up with a broken website, don worry if you found error regarding a plugin called xcalendar, then go edit the wp-config file and remove the line that call that plugin.\n\n3- Install a security plugin like \"Wordfence\". and do a scan.\n4- Go to database using \"phpmyadmin\" and search post in the wp_posts table, and delete the inserted posts.\n5- Change all passwords, admin, database and even ftp or cpanel pass.\n6- Make sure your wordpress and all plugins are updated.\n7- Install a 404 redirect plugin to make use of the fake links as traffic ;)\n8- Take another backup from the clean version.\n\nGood luck, If you need any help, please let me know.","caption":"kenrys.com","description":"Kenrys are startups consultants, who deliver innovative affordable consultancy for web, mobile development, internet of things in Egypt","created_time":"2015-11-03T02:30:38+11:00","total_likes":5,"total_comments":0},{"id":"172338516139198_1027290353977339","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":"Good Read.","caption":"speakerdeck.com","description":"My new years resolution was to do one project a week for the entire year. This is a presentation on how it's been going, and what I've learned thus far.","created_time":"2015-11-03T04:48:19+11:00","total_likes":6,"total_comments":1},{"id":"172338516139198_1027363840636657","from":{"name":"Hossam Attia Darwish","id":"10158418618555464"},"message":"Hello everybody,\n\nFor a friend, I'm looking for decent training center in Cairo.. for jumpstart Instructor-led Javascript traning courses.\n\nThanks","caption":null,"description":null,"created_time":"2015-11-03T09:05:14+11:00","total_likes":0,"total_comments":1},{"id":"172338516139198_1027013587338349","from":{"name":"Mostafa Hussein","id":"599781276899213"},"message":"الناس اللي بتتعامل مع paypal ايه هي البنوك المصرية اللي بتقبل التحويل من حساب paypal للحساب البنكي ؟ البنك الاهلي مثلا و لا بنك ايه بالظبط اللي اقدر احوله من paypal ؟\n\nشكرا","caption":null,"description":null,"created_time":"2015-11-02T11:45:20+11:00","total_likes":1,"total_comments":13},{"id":"172338516139198_1027490177290690","from":{"name":"Mohammed El Sayed","id":"10154884040390170"},"message":"There is a new Resharper version in town :)","caption":"jetbrains.com","description":"Productivity and code refactoring plugin for Visual Studio 2005, 2008, 2010, and 2012. Supports C#, VB.NET, XAML, ASP.NET, ASP.NET MVC, and build scripts.","created_time":"2015-11-03T18:40:18+11:00","total_likes":1,"total_comments":0},{"id":"172338516139198_1027511757288532","from":{"name":"Aya Esmail","id":"1574769119214976"},"message":"What is the expected salary for senior \"mobile developer\" as start in multinational company?\n\nnote that he have a good technical skills And in light of his background, qualifications and the outcome of the meetings\n\na big IT company choosed him to be senior \nhe have 3 years experience as \"junior mobile developer\"","caption":null,"description":null,"created_time":"2015-11-03T20:29:56+11:00","total_likes":1,"total_comments":3}]}