{"posts":[{"id":"172338516139198_1051463034893404","from":{"name":"Andrew Ramzy Ar","id":"1610161418997329"},"message":"https://www.facebook.com/ASUTC/photos/a.136530403114217.19656.122438451190079/722905357810049/?type=3","caption":null,"description":"Hi all \nHere is a free chance to attend a full day event at Microsoft Egypt Smart Village .\nٍIn brief,\nYou’ll learn how to Build, Deploy, Scale a website using latest Microsoft Technology ASP.NET , Azure , Visual Studio 2015\nEvent Date \nYou can choose from this two days\nSunday/12/2015 from 9:30 am to 4:30 pm\nhttp://bit.ly/1kjWNcz\nMonday/12/2015 from 9:30 am to 4:30 pm  \nhttp://bit.ly/1QMPDMz\nand Don't forget to share your moments in the event with us \nsend us your feedback and photos or hashtag it with #MicrosoftWebCamp\n..\nفرصة مجانية لحضور تدريب لمدة يوم كامل في مقر شركة مايكروسوفت مصر بالقرية الذكية \nلكل المهتمين بمجال تطوير المواقع الالكترونية سواء كنت مبتدئ او من اصحاب المواقع \nهتعرف اكتر عن احدث تكنولوجيا مايكروسوفت لتطوير و استضافة المواقع المجانية / المدفوعة\nميعاد التدريب \nيمكنك الاختيار مابين الحضور في يومين -ايهما مناسب لجدول اعمالك - \nالاحد\n  27/12/2015 from 9:30 am to 4:30 pm\nhttp://bit.ly/1kjWNcz\nالاثنين\n  28/12/2015 from 9:30 am to 4:30 pm  \nhttp://bit.ly/1QMPDMz\n\nولا تنسي مشاركتنا احداث التدريب بما تعلمت و رأيك فيه \nراسلنا بما تريد نشره او استخدم هاش تاج \n#MicrosoftWebCamp","created_time":"2015-12-26T10:04:00+11:00","total_likes":2,"total_comments":0},{"id":"172338516139198_1051360661570308","from":{"name":"George Emad","id":"10212478361980563"},"message":"a question for python developers :\ni want to develop a desktop application \"under Linux environment\" to to control a robot using tcp/ip , what is the best tool that i can use to develop the GUI\nafter hours of search i found those please recommend the best within them or suggest a better one :\n*pygubu \n*pyQt\n*glade \n\nthanks in advance","caption":null,"description":null,"created_time":"2015-12-26T05:50:46+11:00","total_likes":0,"total_comments":5},{"id":"172338516139198_1051498621556512","from":{"name":"Mody Bols","id":"1832904946969877"},"message":"حد يعرف طريقة ارجع بيها ابليكيشن عملتله uninstall علشان مسحت برنامج اسمه qualcomm atheros خلى الواى فاى مش شغال","caption":null,"description":null,"created_time":"2015-12-26T12:22:32+11:00","total_likes":0,"total_comments":1},{"id":"172338516139198_1051243404915367","from":{"name":"Muhammad Sherbeeny","id":"10158237074750527"},"message":"انا بدور على موقع يكون بيعمل \nOnline hackathons\nبشكل دوري ومستمر... كل اسبوع مثلا\nبحيث ان الشركات او اصحاب الافكار يبدأوا المشروع... والمطورين والمصممين اللي تعجبهم الفكرة ينضموا للفريق ويسابقوا الزمن لتنفيذ المشروع... وممكن بعد كده يبقوا مؤسسين مع بعض.\n\nببساطة.. عندي كذا فكرة وعايز احط ولو واحدة منهم على احد المواقع دي واشوف ايه اللي هيحصل؟\nهتتنفذ ولا لأ؟\nوبجودة عاملة ازاي؟\nووقت قد ايه؟\nوازاي بيتم حماية حقوق كل طرف؟\n\nانا قصدي ان الموضوع يبقى مركز على التنفيذ السريع اكتر\nHackathon\nيعني مفيش وقت لاتفاقات ومقابلات والقصص دي\nالاطراف المختلفة بيدخلوا الهاكاثون وكتير منهم مش عارفين بعض\nاللي عندوا فكرة بيقولها.. وبيقول محتاج ناس عاملة ازاي للتنفيذ\nولو ناس كتير راحتله يبقى بيختار اللي يعجبه فقط\nوبسرعة كل فريق يبدأ ينفذ قبل ما وقت السباق يخلص\nاحيانا ٢٤ ساعة او اسبوع مثلا\nبعد كده المشاريع اللي خلصت بتتعرض على الجمهور واكتر فريق بياخد اصوات بيكسب الجايزة اللي احيانا بتكون مادية او خدماتية ودعائية.\n\nالمهم... ان الموضوع كله بيركز على التنفيذ السريع وخلاص... مش شرط اللي ينفذوا مع بعض دول يكملوا كشركاء بعد كده.. ده موضوع تاني ممكن يتعمل من خلال:\nCofounderslab\nCofoundersdating\nAngels list\nF6S\nLinkedin!\n\nانما بالنسبة للهاكثون .. فانا لاقيت ٣ مواقع (في الصور)\nبس للاسف انا ماشاركتش قبل كده في هاكاثون اونلاين او اوفلاين\nوبالتالي ماقادرش احكم ايهم افضل واقرب للواقعي وفعّال اكتر؟\nوهل في غيرهم افضل ؟\n\nولا الناس الجامدين اللي هنا يعملولنا واحد جديد ولا إيه؟ D:","caption":null,"description":null,"created_time":"2015-12-26T00:54:02+11:00","total_likes":13,"total_comments":6},{"id":"172338516139198_1051833374856370","from":{"name":"Ahmed Ayman Aladeeb","id":"965840623552738"},"message":"We've had a great 2015 -jk- and by the looks of it 2016 is going to be even more awesome -jk again-. What’s on your list of things to learn in 2016?","caption":"tutorialzine.com","description":"Here are our suggestions for what you should learn in 2016. The languages, frameworks and tools that we've chosen are popular, with large communities and lots of career opportunities.","created_time":"2015-12-27T04:28:06+11:00","total_likes":5,"total_comments":0},{"id":"172338516139198_1051849601521414","from":{"name":"Alaa Attya Mohamed","id":"10210243495897310"},"message":"Switching to modular JavaScript using npm and es6\n\n","caption":"wesbos.com","description":"A big thanks to bitHound for sponsoring my time to research and write this article. Check out their service, which provides continuous analysis and quality checks for both your front and back end J…","created_time":"2015-12-27T05:11:57+11:00","total_likes":16,"total_comments":1},{"id":"172338516139198_1047305911975783","from":{"name":"Amgad Muhammad","id":"1694193320879068"},"message":"It is finally out. My first book is published :)\n\nThe book is discussing computer vision and machine learning algorithms and how you can use them on your Android device, it is an easy-to-follow tutorial with a touch of theory and a complete implementation of interesting applications.\n\nYou can find it on Amazon and other books retailers.","caption":"slideshare.net","description":"Chapter No. 2 App 1 – Building Your Own Darkroom Develop vision-aware and intelligent Android applications with the robust OpenCV library For more information:…","created_time":"2015-12-18T08:22:37+11:00","total_likes":25,"total_comments":14},{"id":"172338516139198_1051856881520686","from":{"name":"Mohammad Sakr","id":"1088031311307136"},"message":"هل في tutorial بيشرح عن طريق عمل project كامل في ال c# , asp.net انا لقيت حاجة عربي بس صغيره عايز حاجة اكبر و شاملة","caption":"asp.net","description":"ASP.NET is a free web framework for building great Web sites and Web applications using HTML, CSS and JavaScript.","created_time":"2015-12-27T05:36:19+11:00","total_likes":0,"total_comments":2},{"id":"172338516139198_1051913288181712","from":{"name":"Tamer Solieman","id":"10154649861213019"},"message":"How to organise your email?","caption":"youtube.com","description":"كيف تقوم بتنظيم بريدك الالكتروني الخاص بعملك","created_time":"2015-12-27T08:48:15+11:00","total_likes":1,"total_comments":0},{"id":"172338516139198_1049610805078627","from":{"name":"Meligy","id":"10154884040385170"},"message":"الاخوة الجيكس، خصوصا اللي عندي من الناس اللي هنا، منتشر قوي عندهم عقدة من اللي يقولك الفيس ولا الواتس ولا فلاشة النت.\nالحقيقة كنت عايز أتكلم من زمان عن ان ده عادي مش مشكلة خالص، بس الراجل ده قال الأمثلة و الكلام بطريقة هايلة بالفعل، فأنا هأشير كلامه بس، مع تأكيدي إني فعلا سمعت أغلب الأمثلة دي من ناس متعلمين وزي الفل في استراليا.","caption":null,"description":null,"created_time":"2015-12-22T23:43:18+11:00","total_likes":25,"total_comments":13}]}