{"posts":[{"id":"172338516139198_453138071392573","from":{"name":"Abdelrady Fcis","id":"10211811206896077"},"message":"Windows 7 Tips And Tricks\nDo any one knows that when pressing shift key and then right click over any folder the popup menu shows new command \"Open Command Window Here\" which will open command prompt(cmd) with default directory will be this folder\nIt was a tough operation in previous OSs\nThank's windows 7 :)","caption":null,"description":null,"created_time":"2012-08-26T10:42:50+10:00","total_likes":2,"total_comments":3},{"id":"172338516139198_453559754683738","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":"HTML5 has a whole bunch of new elements for adding semantic meaning to your pages. For instance, nav signifies a navigational menu.\n\nSince IE8 doesn’t know anything about these, it won’t recognize styles applied to them via CSS. Fortunately, there is an easy way to fix this by simply appending missing elements to the DOM of the page:\n\n Collapse | Copy Code\n<!--[if lt IE 9]>\n   <script>\n      document.createElement('header');\n      document.createElement('nav');\n      document.createElement('section');\n      document.createElement('article');\n      document.createElement('aside');\n      document.createElement('footer');\n   </script>\n<![endif]-->","caption":null,"description":null,"created_time":"2012-08-27T13:06:22+10:00","total_likes":1,"total_comments":0},{"id":"172338516139198_453578491348531","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":null,"caption":"jsperf.com","description":"A simple performance comparison between two different methods of checking for canvas existence.  Both methods are given in answer to this question on Stack Overflow.…","created_time":"2012-08-27T14:32:40+10:00","total_likes":0,"total_comments":0},{"id":"172338516139198_453733384666375","from":{"name":"Haytham ElFadeel","id":"10155089129978350"},"message":"Join the folks Kngine\nhttp://kngine.com/position11.html","caption":"kngine.com","description":"Kngine is the single repository for all Knowledge","created_time":"2012-08-28T01:34:20+10:00","total_likes":0,"total_comments":0},{"id":"172338516139198_453755167997530","from":{"name":"Haytham ElFadeel","id":"10155089129978350"},"message":"Joing Kngine - we're looking for people with experience in NLP, Machine Learning, Question Answering.\n\nIf you interest but don't have experience you still can join Kngine University : http://kngine.com/position11.html","caption":"kngine.com","description":"Kngine is the single repository for all Knowledge","created_time":"2012-08-28T02:51:50+10:00","total_likes":0,"total_comments":2},{"id":"172338516139198_453705384669175","from":{"name":"Yasser Makram","id":"10154130456916548"},"message":"خالتي شماته أو بيل كوكس مسؤول التسويق عن ويندوز فون يقول على تويتر \"ويندوز فون شكله حلووووووووو دلوقتي\" https://twitter.com/billcox/status/239143828081229825 في نفسنه وشماته واضحه في أندرويد. ويبدو أنها تحمل بعض الحقيقة فقد قفزت أسهم نوكيا -المصنع الوحيد الذي استثمر بقوة في ويندوز فون- ١٠٪ في بورصة فرانكفورت. مصائب قوم عند قوم فوائد.","caption":"twitter.com","description":"Instantly connect to what's most important to you. Follow your friends, experts, favorite celebrities, and breaking news.","created_time":"2012-08-28T00:03:49+10:00","total_likes":1,"total_comments":1},{"id":"172338516139198_454572931249087","from":{"name":"Yasser Makram","id":"10154130456916548"},"message":null,"caption":null,"description":"انتشرت أخبار أن سامسونج ستدفع الغرامة سنتات وف اتصال حصري مع الحاج سامسونج أكد أن هذه مجرد إشاعة وأنه كان ينتوي جمع بليون دولار مكونة من أرباع جنيهات مصرية مخرومة إلا أن أبل هددت بمقاضاتهم حيث أن الخرم في الربع جنية مشابه للهوم بتون في الأي فون وتطالب سامسونج بعدم التقليد والمزيد من الإبداع.","created_time":"2012-08-30T07:21:39+10:00","total_likes":3,"total_comments":0},{"id":"172338516139198_454353694604344","from":{"name":"Yasser Makram","id":"10154130456916548"},"message":null,"caption":null,"description":"هل تمتلك جهازا بدون خاصية الجي بي إس ومع ذلك يمكن تحديد مكانك بدقة عالية. لاحظت ذلك مع جهاز iPod الخاص بي فمع تأكدي من خلوه من تقنية gps إلا أن خرائطه كان يمكنها تحديد مكاني. بالبحث وجدت أن أحد التقنيات المستخدم هو سيارات تدور لتلتقط إشارات المودمات اللاسلكية وتسجيل أسمائها وأماكنها وبالتالي يمكن استخدام هذه المعلومات لتحديد مكان أي جهاز يستخدم هذه المودمات.\nولكن بعد تركيبي لمودم بأيام قليلة وجدت مكاني قد تم تحديده بدقه خارج العاصمة وبدون وجود شبكات لا سلكية أخرى قريبة تبينت أن التقنية المستخدمة ولا بد أنها تعتمد أسلوب آخر أقل تكلفة وأكثر انتشارا.\nتبينت أن معظم شركات الهاتف النقال تجمع بيانات مستمرة بالشبكات اللاسلكية وأماكنها مما يجهل كل جهاز هاتف مزود بخاصية gps جاسوس خفي يتعرف على مكانك.\nهذه التقنية بالطبع سلاح ذو حدين فهي تتيح خدمات أفضل تعتمد على المكان إلا أنها في نفس الوقت تنتهك الخصوصية وتضعك دائما تحت شكل من أشكال الرقابة.","created_time":"2012-08-29T18:11:52+10:00","total_likes":0,"total_comments":4},{"id":"172338516139198_454785041227876","from":{"name":"Mohamed Sameeh Sharaf","id":"1704851202862067"},"message":null,"caption":"programmers.blogoverflow.com","description":"One of the very first ideas we had for this blog was to convert some of the wonderful gems of the early era of our site, the undisciplined period, to blog posts. Questions that were once enthusiastically received by the community, but no longer fit Programmer’s scope.","created_time":"2012-08-30T22:23:50+10:00","total_likes":0,"total_comments":0},{"id":"172338516139198_454788791227501","from":{"name":"Ahmed Magdy","id":"10154728972235376"},"message":"How to fix \"Namespace prefix 'xsd' is not defined.\" error in SharePoint 2010","caption":null,"description":"Microsoft SharePoint 2010: If you got \"Namespace prefix 'xsd' is not defined.\" error as in the image so to fix this:\r\n\r\n1) Set your browser to use IE8 standards - you can do this by using F12 to get the IE developer tools panel and setting Document Mode to IE8 standards in the developer tools menu/ribbon thing.\r\n\r\n2) Add the meta tag: <meta http-equiv=\"X-UA-Compatible\" content=\"IE=8\"/> to your master page. This will force the browser to use IE8 Standards.\r\n\r\nUnfortunately you lose the benefit of the IE9 rendering engine which why it might be preferable to use the first method as and when required, rather than forcing all IE9 users to effectively downgrade to view your pages.\r\n\r\nRef: http://www.spdoctor.net/Pages/message.aspx?name=namespace-prefix-xsd-is-not-defined","created_time":"2012-08-30T22:36:49+10:00","total_likes":1,"total_comments":0}]}