{"posts":[{"id":"172338516139198_1130359347003772","from":{"name":"Khaled Ramadan","id":"10155975474214478"},"message":"السلام عليكم\nالى المهاويس :) سؤال مهم جدا وعايز اخد رأيكم معايا فيه\nليه فى الخارج افكار بسيطة جدا وبتنجح نجاح غير متوقع زى مثلا فيسبوك وتويتر وغيرها!!\nفى شركات فى مصر بتنتج مواقع وبرامج محتواها ادق واعمق وافكار ممتازة بس فى الأخر ولا حد بيدخل عليها ولا بيشترك حتى فيها مع انها ايضا بالمجان وبدون ذكر امثلة لها علشان مش ناقصة :)","caption":null,"description":null,"created_time":"2016-04-24T05:14:49+10:00","total_likes":18,"total_comments":25},{"id":"172338516139198_1130352893671084","from":{"name":"Muhammad Sherbeeny","id":"10158237074750527"},"message":"ايه رأيكم في البرنامج ده؟\nوهل في افضل منه؟","caption":null,"description":"هل نقدر نتواصل مع بعض (دردشة وصور) اذا اتوقفت شبكات المحمول والانترنت والارضي؟\nنقدر.. لما كلنا ننزل برنامج:\nFireChat\n(شرح اكتر في التعليقات)","created_time":"2016-04-24T04:59:16+10:00","total_likes":3,"total_comments":2},{"id":"172338516139198_1130687430304297","from":{"name":"Tarek Amr","id":"10154871355735944"},"message":"Now, political effing correctness wants to intervene with software development\n\n","caption":"github.com","description":"Inspired by django/django#2692, Redis should replace its \"master\" and \"slave\" terminology. The summary is: master and slave have racial meanings (especially in North America, but also more genera...","created_time":"2016-04-24T17:38:04+10:00","total_likes":8,"total_comments":6},{"id":"172338516139198_1130458143660559","from":{"name":"Mina Alfy Shaker","id":"1898274457058062"},"message":"عايز اعمل integration test ل web service في الاندرويد ؟؟\nعملت search بس للاسف ملقتش حاجه واضحه واقدر ابتدي منها \nهل حد عنده اقنراحات \nوشكرا مقدما","caption":null,"description":null,"created_time":"2016-04-24T09:18:54+10:00","total_likes":3,"total_comments":8},{"id":"172338516139198_1131100500262990","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":"Product and UX is totally different and need a better approach that Normally any software development agency would miss. My first in the upcoming series of Reviewing startups and Mobile Apps.","caption":"medium.com","description":"I’ve decided to start writing a series of write ups to share my experience and help startups getting to know suffering p…","created_time":"2016-04-25T09:14:58+10:00","total_likes":2,"total_comments":0},{"id":"172338516139198_1131148790258161","from":{"name":"Geish","id":"959423756286"},"message":"One of the nastiest bugs I ran into back in the day...","caption":"linkedin.com","description":"The concept of time in computing is as important as the role it plays in other aspects of life. For any non-trivial program, understanding the order of events (e.g. reading and writing data) is key to","created_time":"2016-04-25T10:46:06+10:00","total_likes":2,"total_comments":0},{"id":"172338516139198_1130394613666912","from":{"name":"Rafael Adel","id":"10155242150027122"},"message":"حي يعرف الكتاب ده بيتباع فى سور الازبكية او شافه هناك ولا لأ ؟","caption":"amazon.com","description":"Written by acclaimed author and mathematician George Simmons, this revision is designed for the calculus course offered in two and four year colleges and universities. It takes an intuitive approach to calculus and focuses on the application of methods to real-world problems. Throughout the text,...","created_time":"2016-04-24T06:23:29+10:00","total_likes":0,"total_comments":1},{"id":"172338516139198_1129637333742640","from":{"name":"Ahmed Mahmoud","id":"1360592964014097"},"message":"I used to use gitk as an essential tool with git \nI was very productive and comfortable with it.\n\nnow I had to work on mac machine \nafter making the configurations necessary to have gitk in my bash.\n \nI had a weird problem that after opening it by 30 second it hangs and consume 100% of cpu \nthen it returns to normal state and then hangs and so on.\n\nIf you can help me please as I didn't find any other tool that can really replace it for me \nI tried gitx and other tools but it's never like gitk \"in my opinion\"","caption":null,"description":null,"created_time":"2016-04-23T01:52:24+10:00","total_likes":0,"total_comments":3},{"id":"172338516139198_1131514536888253","from":{"name":"Ahmed Mohamed Salim","id":"10208638569540012"},"message":"حد جرب اي OCR Arabic يقدر يفيدنا فيه بلغه ال C#","caption":null,"description":null,"created_time":"2016-04-26T01:23:27+10:00","total_likes":1,"total_comments":5},{"id":"172338516139198_1131028716936835","from":{"name":"Ahmad Alfy","id":"10154097389365670"},"message":"An amazing documentary about the journey to build the navigation computer that Apollo 18 crew used to navigate their ship when they were on the dark side of the moon.\n\nComputers at this time used to be huge and heavy and it was almost impossible to use the same computers used in the 60s for that journey. The documentary shows how MIT staff wrote their programs and how they built compact small machines that wasn't possible at this time.\n\nThere is a lot of interviews with software developers who worked on the mission and a lot of interesting information for us as programmers. During the landing process they had an error with the code 1202. It was the code for the overflow error. Normally it should've crashed but thanks to an engineer who built a revolutionary operating system at this time that allowed the computer to dump less important tasks and operations in favor for the important stuff.\n\nThis is a documentary that is worth every minute of your time to watch. Enjoy it.","caption":"dailymotion.com","description":"The third episode details the story of MIT's work on the Apollo Guidance Computer.","created_time":"2016-04-25T06:06:35+10:00","total_likes":9,"total_comments":3}]}