{"posts":[{"id":"172338516139198_1034300403276334","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":"https://uideo.net/videos","caption":"uideo.net","description":"Videos from conferences about design, usability, ux, ui.","created_time":"2015-11-20T08:26:21+11:00","total_likes":1,"total_comments":0},{"id":"172338516139198_1034375533268821","from":{"name":"Mohammad Alaggan","id":"10154136920322085"},"message":"https://http2.cloudflare.com/the-story-of-one-latency-spike/","caption":"blog.cloudflare.com","description":"A customer reported an unusual problem with our CloudFlare CDN: our servers were responding to some HTTP requests slowly. Extremely slowly. 30 seconds slowly. This happened very rarely and wasn't easily reproducible. To make things worse all our usual monitoring...","created_time":"2015-11-20T12:51:34+11:00","total_likes":2,"total_comments":0},{"id":"172338516139198_1034323179940723","from":{"name":"Mohamed ǮLi","id":"1288835557871555"},"message":"لو فيه حد شغال في مشاريع التخرج و بيدور علي سبونسر ITIDA فتحت التقديم","caption":null,"description":"#شير_فى_الخير  #تمويل_مشروعات_التخرج  #ITIDA\n\nهيئة تنمية صناعة تكنولوجيا المعلومات (ITIDA) بتقدم برنامج دعم و تمويل مشاريع التخرج للكليات الهندسية قسم حاسبات و اتصالات و ميكاترونكس و كليات حاسبات و معلومات.\n\n* عندك فكرة مشروع تخرج كويسة مبتكرة , بتدور علي سبونسر. ITIDA بتقدم للطلبة دعم لمشاريع التخرج يصل الى 10,000 جنية  مصرى :)\n\n* تم فتح الباب لتقديم Proposal المشروع : http://goo.gl/o4tWpj\n((اخر ميعاد للتقديم 30 نوفمبر))\n\n#Egypt_Tech_Group","created_time":"2015-11-20T09:44:26+11:00","total_likes":2,"total_comments":1},{"id":"172338516139198_1034452219927819","from":{"name":"Meligy","id":"10154884040385170"},"message":"A classic quote worth remembering.\nOn that note, there's a good book on the topic called \"Soft Skills: The software developer's life manual\" by John Sonmez. Recommended.\nHe also has a free youtube channel called SimpleProgrammer that has a lot of videos on career and soft skill topics.\n\nThere is one important point to make clear though. These numbers do NOT`mean you should have %15 technical skills and 85% soft skills.\n\nThis totally depends on your role. Each role is different. this ratio might work for entrepreneur, they definitely won't work for a senior developer.\n\nThe numbers don't represent the investment you need to put, but the effect.\n\nIf I want to move from developer to senior developer, learning to know how to deliver feedback to other developers, how to communicate technical problems to business people, can make WAY more valuable senior developer.\n\nAnd \"likely\" a higher paid one (because you deliver more value, and you know how to present it).\n\nOf course there are exceptions, but I don't think it's smart to optimize your life for trying to be the one who succeeded while failing at leadership skills, or communication with other people.\n\nIf you want to be exceptional, be the one that combines both. Those are quite rare in fact :)","caption":null,"description":"Incredible....and I agree","created_time":"2015-11-20T18:49:28+11:00","total_likes":25,"total_comments":4},{"id":"172338516139198_1034516553254719","from":{"name":"Mohamed Shokr","id":"1414205518631560"},"message":"أنا صحيح مبتدئ في البايثون لكن ملاحظ أننا معندناش كومينتي قوي للبايثون في مصر في حين أن في كتير بايثون ديفيلوبيرز محترفين مصريين و شغالين في مصر ... كومينيتي يكون ليه أسهام حقيقي في ال Open Source Community.. حاجة كده زي PyUk وأمثاله كتيرررررر لدرجة أن كل مدينة بقي ليها ال Python Community الخاص بيها اللي تقريبا كل واحد منهم ليه مؤتمره السنوي .... كل اللي كنت بفكر فيه أننا ليه ميبقاش عندنا PyEgypt ..  ولما دورات كل اللي لقيته ال Repo دي واللي تفاعل عليها كان تقريبا من شخصين بس و أنعدم خالص دلوقتي  حتي ال <https://groups.google.com/forum/#!forum/python-eg\n> google Group بقالها أكتر من سنة مهجورة ... يا تري أيه المشاكل اللي تخلينا منقدرش نعمل PyEgypt ؟؟ \n\nhttps://github.com/Pyeg <1>","caption":"github.com","description":"GitHub is where people build software. More than 11 million people use GitHub to discover, fork, and contribute to over 29 million projects.","created_time":"2015-11-20T22:35:53+11:00","total_likes":11,"total_comments":3},{"id":"172338516139198_1034687553237619","from":{"name":"Emad Elsaid","id":"10154379038212957"},"message":":D الفيديو ده لعبة لعبوها فى مؤتمر روبى الأخير، بيتكلموا فى موضوع لمدة دقيقة و المفروض مايكرروش كلمة مرتين و بيحسبوا النقط للى يكتشف كلمة حد كررها و بيكمل هو الكلام، انا اتفرجت على ربع ساعة و مت على نفسى من الضحك :D","caption":"youtube.com","description":"Just a Ruby Minute We're bringing Just a Minute -- the popular British gameshow format -- to RubyConf! The rules of the game are simple, the results are hila...","created_time":"2015-11-21T07:13:17+11:00","total_likes":21,"total_comments":0},{"id":"172338516139198_1034892293217145","from":{"name":"Muhammad Bassem","id":"10209993936899469"},"message":":'D","caption":"medium.com","description":"The story of the most unusual bug on the most unusual day","created_time":"2015-11-21T20:53:12+11:00","total_likes":1,"total_comments":0},{"id":"172338516139198_1034765103229864","from":{"name":"Meligy","id":"10154884040385170"},"message":"I need to run a logo-design contest for a usergroup I run. The prize will be a gift from one of our sponsors.\n\nI have been thinking. Maybe create a new post in my blog and email it to the group, allow users to use Disqus image upload feature to upload images as comments, and other users can upvote comments.\n\nThis has 2 issues:\n1. It's not straightforward. I'll have to explain it and maybe users won't get it.\n2. Users will not get notified when a new logo is added to vote on.\n\nAny better way to do that?\nPreferably in WordPress, but totally open for other options.","caption":null,"description":null,"created_time":"2015-11-21T11:11:56+11:00","total_likes":3,"total_comments":5},{"id":"172338516139198_1035242723182102","from":{"name":"Ahmad Fatoum","id":"1068666063239339"},"message":":)","caption":null,"description":null,"created_time":"2015-11-22T18:31:58+11:00","total_likes":25,"total_comments":9},{"id":"172338516139198_1035361333170241","from":{"name":"Mohab El-Shishtawy","id":"10212734091166827"},"message":"How google traffic work in Egypt without using any cams to track traffic flow or using any governmental sources ?","caption":null,"description":null,"created_time":"2015-11-23T02:21:35+11:00","total_likes":7,"total_comments":18}]}