{"posts":[{"id":"172338516139198_1086705828035791","from":{"name":"Amir Raouf Saad","id":"10211810321558090"},"message":"If anyone need domain buying only .. message me .. I'll try to deliver you the less price .. and no need to credit cards or online cash\n#help and no additional fees for sure... just have online money want to cash them.. Thanks","caption":null,"description":null,"created_time":"2016-02-26T10:49:19+11:00","total_likes":0,"total_comments":0},{"id":"172338516139198_1085212308185143","from":{"name":"Ahmed Mohamed Abd Elmeguid","id":"902622896506950"},"message":"anyone integrated PAYFORT in an iOS app using their iOS library not using Direct Link?","caption":null,"description":null,"created_time":"2016-02-23T23:52:57+11:00","total_likes":1,"total_comments":2},{"id":"172338516139198_1086969774676063","from":{"name":"Mohamed Samy","id":"10210182218924500"},"message":"Does anyone have/had an access to a Google Glass or can help getting it?","caption":null,"description":null,"created_time":"2016-02-26T22:27:59+11:00","total_likes":2,"total_comments":2},{"id":"172338516139198_1086984824674558","from":{"name":"Sameh Elkhadem","id":"1831821787035137"},"message":null,"caption":"theantimedia.org","description":"Facebook’s new emoji reactions come with a rather important catch.","created_time":"2016-02-26T22:57:09+11:00","total_likes":5,"total_comments":0},{"id":"172338516139198_1087020804670960","from":{"name":"Ahmed Magdy El Hanafy","id":"10212057465741966"},"message":null,"caption":"youtube.com","description":"Read the blog post: https://medium.com/@ianhlake/layouts-attributes-and-you-9e5a4b4fe32c When you pick a layout, think of the children - the child Views and ...","created_time":"2016-02-26T23:48:48+11:00","total_likes":1,"total_comments":0},{"id":"172338516139198_1085983338108040","from":{"name":"Mohamed Elsherif","id":"10158483817400314"},"message":null,"caption":null,"description":null,"created_time":"2016-02-25T06:29:33+11:00","total_likes":23,"total_comments":5},{"id":"172338516139198_1084673208239053","from":{"name":"محمود على","id":"1371403339587094"},"message":"السلام عليكم ورحمة الله وبركاته \nإزيكم ياشباب، يارب تكونوا بخير.\nبعد إذنكم ياشباب كنت محتاج استشارة من الخبراء هامة وعاجلة جداً إذا تكرمتم\n- أنا محتاج أعمل متجر إلكترونى يليق ببراند قوى واحترافى للغاية، ولما طلبت من بعض الشركات، فيه اللى فضَّل البرمجة الخاصة وفيه اللى فضَّل الووردبريس أو الأوبن كارت.\n- أنا بميل إنها تكون ووردبريس أسهل فى الاستخدام، وهايتم تصميمها بشكل أسرع وأرخص وأكثر مرونة، لإنى بحس إن البرمجة الخاصة مكلفة جداً وتصميمها محتاج شهور، ولو محتاج أضيف فيها أى شىء مهما كان بسيط لازم برمجة للإضافة دى، إنما الووردبريس بيوفر معظم الإضافات اللى انت محتاجها، وكفاية إنه Open Source .\nأنا محتاج رأى حضراتكم، وبارك الله فيكم.","caption":null,"description":null,"created_time":"2016-02-23T02:13:10+11:00","total_likes":2,"total_comments":11},{"id":"172338516139198_1086313018075072","from":{"name":"Tarek Amr","id":"10154871355735944"},"message":"I struggle a lot with YouTube recommendations. Out of zillions of videos of Mortada Mansour and El 3elm wel Emaw and such crap, I rarely see something useful. \n\nAnyway, after this short rant, how about we share nice coding-related videos here every now and then? This one is about refactoring, for the Rubyists among you.","caption":"youtube.com","description":"Most developers know enough about refactoring to write code that's pretty good. They create short methods, and classes with one responsibility. They're also ...","created_time":"2016-02-25T20:28:55+11:00","total_likes":3,"total_comments":2},{"id":"172338516139198_1087151817991192","from":{"name":"Abdelrady Fcis","id":"10211811206896077"},"message":"Bottom line is, if you are trying to change someone’s mind, criticism is not an effective way to do it.\n--\nDon't call someone's baby ugly !","caption":null,"description":null,"created_time":"2016-02-27T04:05:59+11:00","total_likes":3,"total_comments":1},{"id":"172338516139198_1086316831408024","from":{"name":"Tarek Amr","id":"10154871355735944"},"message":"I have a mild medical condition, which is, I am allergic to Java. Currently, I have some huge Java code, like some classes are 1,000 lines of code or something. Don't worry, I am not asked to add a single line of code to it. However, I am asked to give some guidelines to the development team, whether we should refactor it. Cut it down into micro-services? Which parts should go into micro-services?? Hopefully, some day, we re-write parts of this code into more human-readable languages. \n\nSo, what I want is a tool that I can point it to the code and it gives me back some statistics, like how many modules are there, how many classes, how big is each class, number of lines is good enough approximation for the complexity to me. Maybe, some additional stuff, like which classes are more tightly coupled to each other or something. Anything else I need to know? Do you know any tools I can use for that?\n\nBig plus to CLI (please, please no eclipse-plugins), hopefully no bells and whistles, less than 50 MB, no Maven and XML-based configurations and such stuff from the 1990's.","caption":null,"description":null,"created_time":"2016-02-25T20:43:11+11:00","total_likes":1,"total_comments":6}]}