{"posts":[{"id":"172338516139198_1045775302128844","from":{"name":"Mohammed Al Ashaal","id":"740831752757314"},"message":"MySQL at Pinterest","caption":"engineering.pinterest.com","description":"“Shard. Or do not shard. There is no try.”                                           - Yoda   This is a technical dive into how we split our data across many MySQL servers. We finished launching this sharding approach in early 2012, and it’s still the system we use today to store our core data. Befo…","created_time":"2015-12-16T19:02:07+11:00","total_likes":3,"total_comments":0},{"id":"172338516139198_1045653008807740","from":{"name":"Meligy","id":"10154884040385170"},"message":"Even if you are not interested in writing ES5 for Angular 2, the article will explain a lot of small pieces that you need to know in order to get to work with Angular 2","caption":"gurustop.net","description":"December 16, 2015Writing #Angular2 Components in JavaScript – Beta0 Edition With a lot of changes happening since Alpha 48 all the way to Alpha 55, the way you write components in general, even in plain JavaScript has changed from what might have seen in other posts.  Then the beta was out. Learn a…","created_time":"2015-12-16T11:49:42+11:00","total_likes":5,"total_comments":2},{"id":"172338516139198_1045828518790189","from":{"name":"Ahmed Magdy","id":"10154728972235376"},"message":"Will it be hard to crack?","caption":null,"description":null,"created_time":"2015-12-16T22:55:00+11:00","total_likes":2,"total_comments":7},{"id":"172338516139198_1045890715450636","from":{"name":"Muhammad Sherbeeny","id":"10158237074750527"},"message":null,"caption":null,"description":null,"created_time":"2015-12-17T00:48:51+11:00","total_likes":1,"total_comments":0},{"id":"172338516139198_1045899345449773","from":{"name":"Ahmed Amin","id":"1813081165632012"},"message":null,"caption":"arabhardware.net","description":"مايكروسوفت تطلق برنامجًا تشجيعيًا للمبرمجين يتضمن أدوات وبرامج تعليمية  قيمتها مئات الدولارات بشكل مجاني إضافة إلى اشتراكات في دروس تطوير تطبيقات المحمول","created_time":"2015-12-17T01:13:46+11:00","total_likes":2,"total_comments":0},{"id":"172338516139198_1047042802002094","from":{"name":"Kogo Mohamed Said","id":"10212310688508425"},"message":"Data recovery from a clicking (external) hard drive ,, any help ? \nPlaces with low cost or advice to do it home ,, I've been watching tons of youtube videos but all are warning from unclean air and stuff like that. \n\nif anyone have any idea or advice about doing that please tell me.","caption":null,"description":null,"created_time":"2015-12-17T20:44:42+11:00","total_likes":1,"total_comments":12},{"id":"172338516139198_1047119921994382","from":{"name":"Mahmoud Said","id":"10158340042205183"},"message":"You don't go fast by writing crap, you don't go fast by rushing, you don't go fast by tearing to the code and making it work and then releasing it as fast as you can.\nYou want to go fast, you do a good job, your grandmother told you this along time ago, right. you want to go fast you go well, you take your time, you study the problem, you move deliberately instead of rapidly.\n-- UncleBob (https://youtu.be/TMuno5RZNeE)","caption":"youtube.com","description":null,"created_time":"2015-12-17T23:19:37+11:00","total_likes":5,"total_comments":0},{"id":"172338516139198_1047153438657697","from":{"name":"Sameh Elkhadem","id":"1831821787035137"},"message":null,"caption":"ghacks.net","description":"Preserving your Privacy in Windows 10 is a free ebook for computer users who already have upgraded a system to Microsoft's new operating system Windows 10, or plan to do so in the future. It covers important privacy topics that include customizing the settings during installation, using a local acco…","created_time":"2015-12-18T01:00:41+11:00","total_likes":1,"total_comments":0},{"id":"172338516139198_1047304298642611","from":{"name":"Ahmed Saleh","id":"1384434324953403"},"message":"web.ts\nCreate Web Apps the Object Oriented way. An Easier, faster, and efficient way to create websites.\n\nFirst, you create a ts class file that extends web.ts.Page.\n\nSecond, Implement the View() Method to return the location of the view page you would like to show, for example, \"/Page1.txt\". You can also return #element (id of an element), which returns the outerHTML content of an element in the document page. The View source file can be designed with HTML Designer softwares.\n\nThird, you implement the Render(document) method callback which is used to render the content when it's already available.\n\nFourth, create instance of this class and cal Load() method to ask to fethch the document in View() and Render(doc) when it's finished fetching.\n\nFifth, Pages are loaded when a Url change is detected and load a different page based on the name of the Hash.\n","caption":"github.com","description":"web.ts - Create Web Apps the Object Oriented way","created_time":"2015-12-18T08:16:53+11:00","total_likes":1,"total_comments":0},{"id":"172338516139198_1047317285307979","from":{"name":"Abdelrady Fcis","id":"10211811206896077"},"message":"LOL :D","caption":"lifehacker.com","description":"Hitting a key over and over again actually works for once. Two security researchers in Spain recently uncovered a strange bug that will let you into most Linux machines just by hitting the backspace key 28 times. Here’s how to fix it and keep your data protected.","created_time":"2015-12-18T09:00:33+11:00","total_likes":7,"total_comments":0}]}