{"posts":[{"id":"172338516139198_1141115922594781","from":{"name":"Said Bakr","id":"10154979109648745"},"message":"لو حد عاوز يتعرف على Yii2 ديفيد كونلي بادئ فيديوهات زي الفل بتعلمها، اسلوبه شيق، الفيديوهات لها subtitles علشان الاستماع، بالاضافة إلى إن نطقه الكلام في اغلبه تقدر تسمعه لو عندك مهارات استماع متوسطة للانجليزي، وهذا هو عنوان قناته على يوتيوب:\n","caption":"youtube.com","description":null,"created_time":"2016-05-11T05:13:16+10:00","total_likes":6,"total_comments":1},{"id":"172338516139198_1141872965852410","from":{"name":"Mostafa Elsayh","id":"1417211125005592"},"message":"Why do we need Enterprise Architecture?\nليه محتاجين Enterprise Architecture\nThe purpose of enterprise architecture is optimize across the enterprise the often fragmented legacy of processes (both manual and automated) into an integrated environment that is responsive to change and supportive of the delivery of the business strategies. \nالغرض من هيكلة المؤسسات هو تحسين وتطوير المؤسسة من إرث قديم من العمليات والإجراءات يدوية كانت أو أليه إلى بيئة متكاملة تستجيب للتغير وداعمة لتنفيذ إستراتيجية العمل بطريقة صحيحة.\nكلام كبير نحاول نفهم جزء جزء:\nالجزء الأول من الإجابة:\nيعنى أيه  fragmented legacy of processes (both manual and automated) \nأو يعنى أيه إرث قديم من العمليات والإجراءات يدوية كانت أو أليه.\nيعنى على مر الزمان شركتك بتكون بتكبر فى خلال عشرة او خمسة عشر سنه الماضية.\nكان فى أنظم جديدة بيتم إضافتها للشركة كل شوية تدريجيا ومش لازم دفعة واحدة ممكن تكون على فترات متباعدة.\nبعض قرارات التحسين أو تطوير الأنظمة بتكون خاطئة ولم تأخذ فى الإعتراب المدى البعيد لهيكلة الشركة أوممكن نوع العمل نفسة يتغير لكن النظام المتبع لم يتغير لملائمة التغيرات التى حدثت وممكن كمان يكون فى أجزاء من النظام موجودة لم تعد مستخدمة نهائيا لكن غير قادرين على التخلص منها بسبب أنه فى إعتقاد أننا بحاجة لها أو مستخدمها أو أننا خايفين نحذفها لانه ممكن فى حاجات معين متشتغلش.\nكل ده معناه fragmented legacy of processes (both manual and automated)\nوده عايزين نصلحة علشان نوصل لــ an integrated environment بيئة متكاملة.\nفلما تبدأ تفكر فى الـ Enterprise Architecture مطلوب منك أنك تفكر فى النظام ككل مترابط ببعضة مش أجزاء منفصلة.\n\nالجزء الثانى من الإجابة:\nThat is responsive to change and supportive of the delivery of the business strategies. \nيعنى الغرض الأساسى من إستخدم الـ Applications أو التطبيقات والتكنولوجيا هو فى الأخر خدمة الـ business strategies أو سياسة العمل والتغير أو الـ change قادم لامحالة، يعنى محتاجين أنه يكون الـ Architecture بتعنا يقدر يتكيف ويتوائم مع أى تغير هيحصل بسهولة وفى مليون سبب يخلوك تغير فى النظام اللى حاليا شغال (قوانين جديدة – تكنولوجيا جديدة – إجراءات جديدة – متطليات عملاء جديدة – مجلس إدارة جديد – تطبيقات جديدة - مليون سبب - ...) فأحنا محتاجين يكون دائما التكيف لأى تغير أسهل ما يمكن، مش عايزين كل مرة أى تغير نضطر أننا نهد الدنيا ونبنيها من الأول تانى فلما العمل يحتاج أى شئ فالمؤسسة بأكملها بالـ Infrastructure اللى موجود لابد أن يتكيفوا لتفيذ أحتياجات العمل.\n\nتعالو نوضح الكلام بطريقة تانية:\nليه محتاجين Enterprise Architecture\nيتبع...","caption":null,"description":null,"created_time":"2016-05-12T11:17:44+10:00","total_likes":2,"total_comments":1},{"id":"172338516139198_1141859732520400","from":{"name":"Mosab Ibrahim","id":"10154868571206047"},"message":"مع كل حبة أعضاء جدد بينضموا للمجموعة، بيحصل إن نسبة كبيرة منهم بتتجاهل تقرأ البوست المثبت في أول المجموعة، اللي فيه قواعد المجموعة البسيطة جدا، والواضحة بضراوة، واللي هم قاعدتين بس أساسا!\n\nالقاعدة التانية بتقول \" - Posting a question? You MUST list what research you did before asking\".\n\nبس برضه، بنلاقي أسئلة أصحابها أصلا ما حاولوش حتى يدوّروا على جوجل على إجابة ليها. في حكمة عظيمة بتقول \"حُسْنُ السؤال نصف العلم\".  وأنا بصراحة لما شفت السؤال ده تحديدا انشكحت :\n\nhttps://www.facebook.com/groups/egyptian.geeks/permalink/1140447972661576/\n\nفي رأيي، ده من أفضل الأسئلة اللي اتسألت مؤخرا هنا. الراجل قال بمنتهى الوضوح، والتسلسل المنطقي:\n\n1. ايه اللي هو بيحاول يوصل له.\n2.  قدم أمثلة عليه علشان يحدد أكتر هو عاوز ايه ويوفر على اللي بيرد إنه يسأله في تفاصيل أكتر.\n3. وضح هو عمل ايه قبل كده.\n4. قال لنا هو ليه عاوز يعمل كده.\n\nالسؤال بالطريقة دي بيجبر اللي بيقرأه يسيب اللي في ايده ويرد عليه. أول ما قرأته، فتحت البوست وقرأت كل التعليقات، واكتشفت إن الشركات اللي أعرفها حد كتبها بالفعل، فاتضايقت إني ما عرفتش أساهم في الرد على السؤال.\n\nيا ريت كل الناس تحاول تبذل مجهود في أسئلتها، لأن ده هيوفر للي سأل واللي ناوي يرد، أو حتى مجرد عضو بيعمل scrolling في الـgroup، وقت وجهد وأعصاب كتير.\n\nشكرا يا عمر على السؤال ده.\n\n---\nروابط أخرى مهمة للغاية في هذا السياق:\n\n- How do I ask a good question? :  http://stackoverflow.com/help/how-to-ask\n- Rubber Duck Problem Solving: http://blog.codinghorror.com/rubber-duck-problem-solving/","caption":null,"description":null,"created_time":"2016-05-12T10:43:37+10:00","total_likes":25,"total_comments":5},{"id":"172338516139198_1141614605878246","from":{"name":"Alaa Attya Mohamed","id":"10210243495897310"},"message":"#Reactjs unit testing \n\n","caption":"hashnode.com","description":"React components are modular and composable. And Unit tests exist to tests software modules. Hence it makes React components a perfect candidate for Unit t.","created_time":"2016-05-12T01:18:07+10:00","total_likes":1,"total_comments":1},{"id":"172338516139198_1142071312499242","from":{"name":"Mohamed A. Baset","id":"1695725103775903"},"message":"How could a WebApp bug affects your physical device!","caption":"www.seekurity.com","description":"Firefox OS Find My Device Service Clickjacking Bug results in Changing PINs, Wiping and Locking Phones! Introduction: Physical devices connected with web applications made everything easy to be managed. Screen size, availability, usage etc… is what pushing everyone to manage their devices through th...","created_time":"2016-05-12T21:19:32+10:00","total_likes":16,"total_comments":0},{"id":"172338516139198_1141800725859634","from":{"name":"Mohamed A. Alqrwash","id":"10210601405564635"},"message":"Hi GeeKs ,  i would like to ask where could i get \" Axiom m5235BCC Coldfire Evaluation board \"\nin Egypt and { if else } could i run RTEMS 4.10 Operating System \nin arduino or  raspberry pi","caption":null,"description":null,"created_time":"2016-05-12T08:17:12+10:00","total_likes":0,"total_comments":11},{"id":"172338516139198_1142202569152783","from":{"name":"Adam Zahran","id":"1616318368386204"},"message":"hahaha which ones are you? :D","caption":null,"description":"لو دخلت وسط مجتمعات Linux هتلاقي ٦ أنواع من الناس :D\nأنت أنهي نوع؟ :D","created_time":"2016-05-13T01:41:19+10:00","total_likes":7,"total_comments":0},{"id":"172338516139198_1141954545844252","from":{"name":"Muhammad El-Hennawy","id":"10210432517001560"},"message":"Interesting article !","caption":"social.techcrunch.com","description":"There’s an idea that’s been gaining ground in the tech community lately: Everyone should learn to code. But here’s the problem with that idea: Coding is..","created_time":"2016-05-12T15:19:31+10:00","total_likes":5,"total_comments":2},{"id":"172338516139198_1141671179205922","from":{"name":"Ahmed Magdy El Hanafy","id":"10212057465741966"},"message":"Nabd is on Android Developers youtube channel!","caption":"youtube.com","description":"Founded in 2012, Nabd is a personalised Arabic news aggregator app based in Kuwait, reaching over 10 million people, of which, 60% use Android devices. Watch...","created_time":"2016-05-12T03:07:30+10:00","total_likes":8,"total_comments":1},{"id":"172338516139198_1142254732480900","from":{"name":"Abdelrahman Hegazy","id":"10211760293580576"},"message":null,"caption":null,"description":"“People need to move, and they’ll move in whichever manner that is most efficient and available and affordable,”\n\nHoussam El Okda and Mohamed Hegazy from Transport for Cairo were interviewed by the National about what we are doing to help the transport situation in Cairo. Check out the full article.\n\n\n\"الناس في حاجة إلى التنقل، وبالتالي يختارون أفضل الخيارات من حيث الكفاءة والإتاحة والتكلفة المناسبة لدخولهم\"\n\nحُسام العقدة ومحمد حجازي من فريق مواصلة للقاهرة يتحدثون عمَّا نفعله لتحسين أحوال التنقل في القاهرة. يمكنكم متابعة المقال بالكامل.","created_time":"2016-05-13T03:16:23+10:00","total_likes":2,"total_comments":0}]}