{"posts":[{"id":"172338516139198_1345030932203278","from":{"name":"Eslam Mohamed","id":"1316030208462594"},"message":"صباح الخير يا شباب\nمحتاج tool اقدر اعمل بيها Analysis علي ملف فيه Text والنتيجة تطلع بأكتر الكلمات المتكررة وعدد مرات تكرارها\nحد يعرف حاجة زي كدا؟","caption":null,"description":null,"created_time":"2017-01-04T13:09:19+11:00","total_likes":0,"total_comments":11},{"id":"172338516139198_1345638318809206","from":{"name":"Hassan Saad","id":"303806276703088"},"message":null,"caption":null,"description":"عندنا خبرين ، واحد حلو و واحد وحش :3 \n\nوكالعادة نبدء بالوحش :P \n\nالخبر الوحش : ان احنا المفروض كنا نزلنا كورس قبل كده على اليوتيوب اسمه Advanced Penetration Testing بس للاسف الكورس مكملش عشان كان فيه Gap مابين مستوى بعض الناس و مستوى اول Two Levels منه عشان كده اضطرينا اننا نوقفه نظرا لان الغالبية العظمى مش مستفيدة وحسينا اننا المفروض كنا ننزل Levels  اقل من كده شوية فى الاول وبعدين كنا ممكن ننزل الكورس كده فا ده كان سبب ليه احنا وقفنا الكورس ده عشان فى خلال الفترة ديه كنا بنحاول نشوف حل للموضوع ده فا وصلنا لاننا لازم ننزل كورس تانى قبل ما نكمل الكورس دع ويكون الكورس للـ Beginners اكتر , بحيث يوفر ليهم بعض ال Basics of Linux فى الاول عشان يقدروا يفهموا الكورس الـ Advanced شوية , وده فعلا ال عملناه , الحمد لله حاليا وانت بتقرء البوست ده , في كورس اترفع فعليا على ال Channel بتاعتنا على اليوتيوب بيشرح Linux Basics للناس ال عندها مشكلة فى الحتة ديه ^_^\n\nوالخبر الحلو بقه اننا حنرجع تانى نكمل الكورس الـ كنا بدءناه\n\nفا الناس ال عيزه تبدء من الاول بقه فا حيكون التسلسل كالأتى :- \n\nاول حاجة تدرس كورس الـ Linux Basics ده وبعدين تقدر تروح تدرس كورس Advanced Penetration Testing \n\nالمفروض الـ احنا حنبدء نعمله بقه من هنا ورايح اننا نمسكAttack Attack ونحاول نفهم كويس ايه الـ Mechanism الـ شغالة بيه وبعدين نطبقها عملى عشان نشوف تأثيرها وازاى كمان نقدر نوقفها ^_^ و طبعا لو فيه اى Attack مترتبة على Knowledge تانية قبليها فا الاول لازم طبعا نشرح الحاجة دى الاول , فا ان شاء الله الموضوع حيكون ممتع جدا ان شاء الله ^_^\n\nوالكورس ده حيكون فيه جزء قدام شوية عن الـ Exploit Development وكمان حيكون فيه جزء عن الـMalware Analysis and Forensic فا ان شاء الله حيكون كورس مفيد جدا و ممتع جدا و تقريبا ده حيكون اول كورس على النت عموما بيشرح الحاجات دى بالعربى ، ولو حد يعرف حاجة بتشرحهم بالعربى ياريت يسيبلنا لينك فى الكومنتات :3 دمتم يخير ^_^\n\nChannel : https://www.youtube.com/c/NineHackers\n\nLinux Basics : https://www.youtube.com/watch?v=a-BgUxDa1vo&list=PLzTb6KlnGyi3qTGSxDY4AuLws1j-kdGt5\n\nAdvanced Penetration Testing : https://www.youtube.com/watch?v=_kG6p7rfIeY&list=PLzTb6KlnGyi2G4DYc7vFKcGYiDV12lllF","created_time":"2017-01-05T06:27:57+11:00","total_likes":6,"total_comments":0},{"id":"172338516139198_1341935205846184","from":{"name":"Anas Emad","id":"10154264552927478"},"message":"واحد صاحبي عامل ابلكيشن طبي مدفوع علي جوجل \nو عاوز يعرف ازاي اعرف ان كان الapk المتسطب ده نازل من متجر جوجل سواء بعملية شراء او لأ ولا نازل من النت بشكل غير قانوني \nلان فيه مواقع و ناس بتشتري النسخة المدفوعة و تنزلها و تعيد رفعها علي مواقعهم تاني و يعمل ريفيند مثلا \nايه تجاربكم العملية في الموضوع ده ؟","caption":null,"description":null,"created_time":"2016-12-31T23:34:50+11:00","total_likes":9,"total_comments":14},{"id":"172338516139198_1345722682134103","from":{"name":"Mohamed Oun","id":"10210546759477547"},"message":"TensorKart: self-driving MarioKart with TensorFlow","caption":"kevinhughes.ca","description":"Kevin Hughes' Blog","created_time":"2017-01-05T08:34:41+11:00","total_likes":1,"total_comments":0},{"id":"172338516139198_1345743638798674","from":{"name":"Khaled M. Diab","id":"10212550395463324"},"message":"Google is building a Python transcompiler and runtime using Go... seems interesting for concurrent workloads in Python. \n\nIt seems that only python 2.7 is supported so far. Also, the Go runtime doesn't allow C extensions (as CPython does)...","caption":"opensource.googleblog.com","description":"Google runs millions of lines of Python code. The front-end server that drives youtube.com and YouTube’s APIs is primarily written in Pytho...","created_time":"2017-01-05T09:15:46+11:00","total_likes":20,"total_comments":0},{"id":"172338516139198_1345879868785051","from":{"name":"Mohamed Moshrif","id":"1235868066468537"},"message":"Does anyone know of any way to download dmg file for MacOS from Windows?\nMy macOS is gone and I need to create a bootable USB to reinstall it but can't find a single working link to download the dmg file","caption":null,"description":null,"created_time":"2017-01-05T13:07:18+11:00","total_likes":0,"total_comments":5},{"id":"172338516139198_1345659248807113","from":{"name":"Ashraf Gawdat","id":"10154025473076618"},"message":"لو انت كمبرمج كنت بتشتغل شغل ريموتلي بارت تايم (جنب الشركة اللي انت فيها يعني) .. وعملت فيه حاجات كويسة فعايز تكتب الحاجات دي في السي في .. السؤال بيقول: هل كتابة إنك كنت شغال بارت تايم دي حاجة كويسة ولا وحشة في السي في؟ يعني هيبص للشغل اللي عملته فيه والتكنولوجيز اللي استخدمتها فيقول الشخص ده كويس .. ولا هيبص لإنك كنت بتشتغل شغل تاني جنب شغلك الأساسي ودي حاجة الشركات مش بتحبها؟\n\nولو كانت حاجة كويسة تتكتب .. تتكتب ازاي؟ مكانها فين يعني في ترتيب الوورك إكسبيرينس في السي في؟ لأن كل إكسبيرينس بيكون بتاريخ بداية وتاريخ نهاية .. وده تواريخه هتكون متداخلة مع شغل أو أشغال تانية .. وموضوع التواريخ ده شغلانة بالذات على لينكد إن.\n\nولو كانت حاجة مش كويسة بس انا عايز اكتب الشغل اللي عملته فيه لأنه مهم ومعملتش زيه في شركة اشتغلت فيها وحاجة تستحق إنها تتتب .. تتكتب ازاي؟ على إنها فري لانس مثلا ولا نفس المشكلة؟","caption":null,"description":null,"created_time":"2017-01-05T07:02:19+11:00","total_likes":3,"total_comments":6},{"id":"172338516139198_1346134592092912","from":{"name":"Mohamed Elsherif","id":"952693524866956"},"message":"Discussion : will voice be the new Touch screen ?","caption":"quora.com","description":"Did you unwrap a smart speaker during the holidays this year? If so, we're thrilled to let you know that Quora is available for Google Home and Amazon Echo. At Quora our mission is to grow and share the world's knowledge, and achieving this mission means making Quora accessible on more platform...","created_time":"2017-01-05T20:18:49+11:00","total_likes":0,"total_comments":0},{"id":"172338516139198_1346209412085430","from":{"name":"Mohamed Oun","id":"10210546759477547"},"message":"\"A mystery player causing a stir in the world of Go has been revealed as an updated version of AlphaGo.\"","caption":"nature.com","description":"Updated version of DeepMind's AlphaGo program behind mystery online competitor.","created_time":"2017-01-05T22:27:30+11:00","total_likes":0,"total_comments":0},{"id":"172338516139198_1346258822080489","from":{"name":"Abdelrahman Omran","id":"2022367384657074"},"message":"Do you have an idea for a tech-related product, application or service? Do you have a basic functioning prototype or in the process of developing one?\n\nIf you answered YES to the above, you can now register for TIEC Accelerator 10th round set to start February 2017! Deadline for registration is January 22nd 2017.\n\nhttp://tiec.gov.eg/en-US/Accelerator/Pages/apply.aspx","caption":null,"description":null,"created_time":"2017-01-06T00:12:37+11:00","total_likes":0,"total_comments":1}]}