{"posts":[{"id":"172338516139198_803553249684385","from":{"name":"Maged Eladawy","id":"1220459164735315"},"message":"1- BrainStorming   (Deadline 28 of August)\n\nطيب معتقدش إن كان فيه أى اعتراض واضح على الطريقة اللى اقترحتها فى تجميع الأفكار و تنظيمها و إن احنا نبدأ نشتغل عليها\n\nhttps://www.facebook.com/groups/egyptian.geeks/permalink/803137863059257/\n\nعلشان كده أنا شايف إن انا ممكن أبدأ بأول خطوة وهى إن احنا نجمع أفكار و أقتراحات الناس الموجودة فى الجروب بخصوص المشاريع اللى ممكن نشتغل عليها\n\nمتهيألى أنسب حاجة إننا نجمع الأفكارفى Spreadsheet \nعلشان كده انا عملت فورم على السريع  كده\n\nممكن تحط أفكارك هنا \nhttp://bit.ly/1sj8ZbS\n\nتقدر تشوف الأفكار اللى اتحطت من هنا\nhttp://bit.ly/1p4h5S2\n\nأو تقدر تحط افكارك على جيت هب من هنا\nhttps://github.com/egyptian-geeks/Activities/issues\n\nانا شايف إن ٤ ايام مناسب لأى حد إنه يحط أفكارة...لو حد عنده اعتراض على الوقت أو طريقة جمع الأفكار عمتا ممكن يدينا اقترحاتة\n\nSpreadsheet إنشاء الله بعد ما نجمع الأفكار هحط الــ\n هنا فى الجروب و نبدأ نحط طريقة تانية نقيم بيها  الأفكار دى...","caption":null,"description":null,"created_time":"2014-08-24T19:39:16+10:00","total_likes":6,"total_comments":25},{"id":"172338516139198_804039212969122","from":{"name":"Amr Monjid","id":"10154967136370729"},"message":"How to install SharePoint 2013 prerequisites on Windows Server 2012 R2 manually","caption":"amrmonjid.wordpress.com","description":" After I installed my Windows Server 2012 180 days trial version I decided to install SharePoint Server 2013 and give it a try (I know I'm late but being late is better than never ;) )I was very ex...","created_time":"2014-08-25T21:51:06+10:00","total_likes":1,"total_comments":0},{"id":"172338516139198_804080196298357","from":{"name":"Amr Monjid","id":"10154967136370729"},"message":"Create the Configuration Database for Standalone installation with a Local Account – SharePoint Server 2013","caption":"amrmonjid.wordpress.com","description":"After I'm done installing SharePoint Server 2013 on Windows Server 2012 R2 I ran the configuration wizard to finalize and configure the installation At the step \"Specify Configuration Database Sett...","created_time":"2014-08-25T23:51:39+10:00","total_likes":1,"total_comments":0},{"id":"172338516139198_804170229622687","from":{"name":"Amr Monjid","id":"10154967136370729"},"message":"State Service Configuration in Microsoft #SharePoint Server 2013\n\nError/Fix: The form cannot be rendered. This may be due to a misconfiguration of the Microsoft SharePoint Server State Service. For more information, contact your server administrator","caption":"amrmonjid.wordpress.com","description":"After installing SharePoint Server 2013 I created a site collection, when I tried to perform a simple approval workflow I got the below error The form cannot be rendered. This may be due to a misco...","created_time":"2014-08-26T03:05:13+10:00","total_likes":0,"total_comments":0},{"id":"172338516139198_803137863059257","from":{"name":"Maged Eladawy","id":"1220459164735315"},"message":"انا شايف إن احنا محتاجين شوية Activities فى الجروب أكتر من مجرد إننا نعمل شير لـ Articles من Resources مختلفة (مع تحفظى إن دى حاجة مهمة بردو)...\n\nممكن يكون سبب إنى متفاعلتش مع الــنشاطات اللى قبل كده إن انا أولا محستش بأهميتها قوى (ممكن تكون مهمة بالنسبة لأشخاص تانية)\n\nثانيا هى بتبقى افكار طالعة من شخص واحد (كتر خيرة) بس أكيد لو الــ Activities اللى بننفذها مبنية على أقتراحاتنا و أفكارنا كلنا هيبقى الموضوع فيه توسع أكتر...\n\nثالثا انا مؤمن بالعمل الجماعى و إن أكثر من شخص يشتغلوا على مشروع وفكرة واحدة وب Standard واحدة أفضل بكتير من إن كل واحد يشتغل مع نفسة...\n\nعلشان كدة أنا بقترح إن الــ LifeCycle بتاعة الـ Activites بتاعتنا تمشى كالتالى\n\n1- BrainStorming (٣ أيام)\nفى المرحلة دى بنجمع أقتراحات المشاكل اللى ممكن نشتغل عليها فى SpreadSheet...المشاكل أو أقتراحات المشاريع اللى كل واحد هيحطها لازم يبقى فيها شوية شروط زى مثلا  إن الفكرة تكون جديدة...الفكرة تكون مفيدة...\nلو مشكلة و بندورلها على حل يبقى لازم تكون المشكلة لاتزال قائمة...ومحدش قدملها حلول لحد دلوقتى...الخ (ممكن أى حد يساعد فى إنه يحط معايير للمشاريع)\n\n٢- Drop & Promote (١ يوم)\nفى المرحلة دى بنصفى الأفكار و المشاكل المقترحة بناء على المعايير اللى المفروض نكون حددناها فى Phase 1\n\n3- Vote (٢ يوم)\nبتتعرض الأقتراحات على الجروب و الناس بتختار المشاكل اللى شايفة إنها ليها Periority أكبر\n\n٤- Who is Involved \nبنجمع الناس اللى شايفة أنها ممكن تساعد أو تشتغل فى المشروع ده و بنعمل WorkGroup/s علشان يشتغلو على المشكلة دى...\n\n٥- Getting Start\nمرحلة ما بعد أختيار المشروع ليها تفاصيل كتير قوى لازم تتناقش من الــ WorkGroup/s Members سواء فى Physical Meeting / Skype Call أو غيرة\nالتفاصيل دى زى\nWho'll lead the project\n\nSuggested Solutions\n\nSelected Solution\n\nSelected Tools (Such as the used programming language & Source Code Management System  \n\nDevelopment live Cycle & Selected Methodology for developing the project...etc\n\n بغض النظر عن الرغى الكتير...انا حابب إن يكون فيه طريقة منظمة..واضحة وصريحة الناس كلها تشتغل و نطلع برودكت حقيقى...","caption":null,"description":null,"created_time":"2014-08-23T20:50:35+10:00","total_likes":18,"total_comments":13},{"id":"172338516139198_804027096303667","from":{"name":"Mohamed Emad","id":"1276111065769406"},"message":"السلام عليكم كنت عاوز اسا سؤال في برمج الويب عاوز textarea  او حاجه زي dialodbox  ليه slider بس انا عاوز اكتب جواه اكواد html وده ما ينفش في text area من الاخر انا عاوز اعمل selection box اعمل ايه","caption":null,"description":null,"created_time":"2014-08-25T21:26:28+10:00","total_likes":0,"total_comments":9},{"id":"172338516139198_803873436319033","from":{"name":"Ahmad Alfy","id":"10154097389365670"},"message":"Some guy posted this photo and called it:\n\"After an internship at Google\"\n:D","caption":null,"description":null,"created_time":"2014-08-25T11:51:18+10:00","total_likes":25,"total_comments":25},{"id":"172338516139198_804637686242608","from":{"name":"Ahmed Kh'aled","id":"1340434959359755"},"message":"أنا عايز أعمل إسكريبت PHP على إستضافة مجانية معينه على النت بتدعم ال PHP بحيث إنها تقدر توريلي ال External IP بتاع الكمبيوتر بتاعي الي في البيت!\nبالراحة كده..\nأنا دلوقتي عندي الجهاز بتعي الي في البيت وهطلق عليه مثلاً HomeServer بيفضل شغال كتير ياعني وعليه SSH و Proxy server وكده على ال HomeServer وبتصل بيه ديماً عن طريق التابلت بتاعي من أماكن برة شبكه البيت لأني عاملع Port forwarding وكده بس المشكله هي في ال External Ip ألي منه هتصل بال HomeServer..\nوعشان كده أنا فكرت في فكرة الموقع الي هعمله بال PHP الي هو المفروض بطريقة ما هيكون متصل ديماً بال HomeServer بحيث إنه أول لما أفتحه المفروض علطول يديني ال External IP ..\nالمشكلة هي إني ممكن بإستخدام ال Sockets أو Telnet حتى أتصل من ال PHP بال HomerServer عن طريق سكريبت Python/PHP/Ruby/..etc بس برضة هتواجهني مشكلة إن ال External IP بيتغير! وكده أنا معملتش حاجة! \nوفكرت برضة في إني أستخدم ال FTP بتاع الإستضافة بحيث مثلاً إن يكون في سكريبت معين على ال HomeServer كل نص ساعة مثلاً يكتب ملف Text على الإستضافة مثلاً وأخلي الموقع الي هيكون معمول بال PHP يقرأ من الملف ده ويعرضه بس حاسس إنها طريقه بدائية جداً..\nيا ريت لو حد عنده حل للموضوع ده ميبخلش عليا وياريت لو الحل ده ميخرجش برة ال PHP و ال Python :D \nوشكراً :D","caption":null,"description":null,"created_time":"2014-08-26T22:47:21+10:00","total_likes":0,"total_comments":23},{"id":"172338516139198_803865449653165","from":{"name":"Ahmad Alfy","id":"10154097389365670"},"message":"Guys I decided I won't just remove posts ... I will ban and block users too ... I am accountable for what I was assigned to and I won't let see some wannabes taking over this place.\nThanks","caption":null,"description":null,"created_time":"2014-08-25T11:31:53+10:00","total_likes":6,"total_comments":25},{"id":"172338516139198_804964116209965","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":"A jQuery plugin that enables you to create a single-scroll layout for a group of sections. @peachananr explains how: ","caption":"smashingmagazine.com","description":"Pete Rojwongsuriya explains how he built One Page Scroll, a plugin that enables you to create a single-scroll layout for a group of sections on a page.","created_time":"2014-08-27T11:51:59+10:00","total_likes":0,"total_comments":0}]}