{"posts":[{"id":"172338516139198_934238893282486","from":{"name":"Ahmed Faĥmŷ","id":"1384388628250242"},"message":"أهم أحداث اليوم الاول من مؤتمر المطورين Microsoft Build 2015","caption":null,"description":"ملخص اليوم الاول من مؤتمر مايكروسوفت\n---------------------\n\nأعلنت Microsoft في مؤتمر المطورين Microsoft Build2015  في سان فرانسيسكو الامريكية\n1 - إن الترقية للإصدار الجديد Windows 10 ستكون مجانية لمدة عام \n2 - تهدف إلى الوصول إلى مليار مستخدم لويندوز 10 تأمل الى تخطى جوجل و التى يعمل بنظامها 500 مليون جهاز .\n3 - الاسم الرسمي لمتصفحها الجديد الذي كان يحمل في السابق اسم “مشروع Spartan” اسمه الرسمى الجديد: Microsoft Edge !! \nو يتميز ببعض الخصائص الإضافية مثل تكامله مع المساعد الصوتي “Cortana” كما سيدعم الإضافات الموجودة في متصفحات فايرفوكس وكروم مع قليلٍ من التعديلات لتعمل مُباشرة على المتصفح\n4 -إتاحة مصدر .NET للمطورين لأنظمة ماك ولينكس لأول مرة !\n5- أعلنت عن متجر مخصص لقطاع الأعمال بإسم Windows Store .\nالفكرة من المتجر هو جعل الامور أسهل بالنسبة لقطاع الاعمال حيث يستطيع المدراء السيطرة على التطبيقات التي يرغبون في ظهورها للموظفين ولكن هذا لايعني ان المتجر مخصص للعمل فحسب فهناك تطبيقات موسيقى وتطبيق Photoshop Elements للتعديل على الصور وغيرها .\n\n6 - بالنسبه للاجهزه اللوحيه واجهة النظام  ستكون مختلفة عليها حيث سيتم وضع الكثير من التطبيقات في قائمة إبدأ \n7 - أكدت ان هناك زر جديد ” للخلف ” سيظهر في الواجهة .. كما سيتكيف النظام مع شاشات اللوحيات كجهاز الكمبيوتر الشخصي مع دعم تطبيقات 32bit واستجابة سريعه للمس \n8- أعلنت عن 425 مليون مستخدم لخدمات Azure\n\n9- أعلنت عن أداه جديده Visual Studio Code لتحرير التعليمات البرمجية لنظام لينكس وماك إضافة لنظام الويندوز أيضاً و تقول انها خفيفة بشكل لايصدق وتقدم الكثير من المزايا للمطورين .\nويمكن للمطور من التطوير على المنصة بأستخدام عدة لغات مثل الجافاسكريبت و asp.net\n\n10-  انك تقدر تكتب objective c على الفيجوال استوديو و يرن عادي على الايفون \n\nيتبع ...","created_time":"2015-05-01T05:37:38+10:00","total_likes":22,"total_comments":1},{"id":"172338516139198_934569049916137","from":{"name":"Karim Ali","id":"1306002799479969"},"message":"My short intro to basket.js, have fun! :)","caption":"medium.com","description":"One of common concerns I faced in web/frontend development is libraries like “Angularjs, Bootstrap, JQuery… etc..” loadi…","created_time":"2015-05-02T02:01:47+10:00","total_likes":12,"total_comments":1},{"id":"172338516139198_934665049906537","from":{"name":"Ahmed Bahnasy","id":"1270319029713569"},"message":"شباب الايفينت ده مهم جدا \nلكل الناس المهتمه بالويب \n\nhttps://www.facebook.com/events/841375902597860/","caption":"المؤتمر المصري الاول لمطوري الويب","description":"ال web؟؟\nفي ناس كتيير اوي بتعرف web كويس في مصر\nبس برده في ناس كتيير عاوزين يتعلموا و يدخلوا المجال ويبدعوا فيه ومش عارفين يبداو منين !!!\n\nوفي ناس كتيير برده واقفبن عند نقطه معبنه و مش عارفين\nيكملوا ويطوروا من نفسهم ازاااااااي !!!!\n\nوفي برده ناس عاوزين يوصلوا علمهم و خبرتهم للناس دي\n\nتخيبل بقي ؟؟؟؟؟؟؟؟؟؟؟\n\nلو جمعنا الناس دي كلها في مكان واحد وخليناهم يتفاعلوا مع بعض في حاجه عمليه\n\nيعني لو مثلا واحد شغال web developer في شركه كبيره يجي ويشنغل معاك في project فعلي\n\nولو مثلا web designer يجي ويعلمك ازاي الشغل بيمشي جوه الشركه وازاي تتعامل مع العملاء\n\nده غيير ان ممكن ناس تكلمك عن التكنولجيا الجديده اللي ظهرت في ال web وازاي تقدر تستفيد منها\n\nطيب ايه ال topics اللي هنتكلم فيها \nاول حاجه هنتكلم عن الفرق بين لغات البرمجه للويب زي ال php ,JSP,ASP.NET, و هكذا\nوبعدين هنتكلم عن ازاي تقدر تعمل plugin بنفسك و اي حد في العالم يقدر يستخدمه بعدك\nوهنتكلم عن ازاي ال web development بيتم في الشركات الكبيره وايه دور \nال web developer جوه الشركه بالظبط وايه هي الحاجات اللي لازم تكون عارفها عشان تقدر تشتغل في شركه كبيره \nوهكذا بالظبط في ال web design \n\nطيب واللي عاوز يشتغل freelancer ؟؟؟؟؟؟؟؟؟؟؟؟؟؟\nدول كمان مش ناسينهم وهنتكلم عن ال freelancing خطوه خطوه\n\nده غير ان احنا هنتكلم عن ال tools الجديده اللي ظهرت في الويب وازاي تقدر تستخدمها \nوده غير برده topics كتييير جدا زي \nsecurity\ncloud-computing \nbootstrap \n\nوالناس اللي هتتكلم في المجالات دي عندهم خبره سنين في المجال ده منهم اللي شغال في شركات ومنهم اللي شغال freelancer وحابين انهم ينقلوا خبرتهم ليكم \nوهنزلكم الاجنده فيها كل حاجه بالتفصيل \nو هتعرفوا مين ال speakers اللي موجوده معانا \nطيب جميل اوي !!!\nامتي بقي الكلام ده وهيبقي فين ؟؟؟\nالميعاد هيكون يوم 8و9 مايو ( الجمعه والسبت الجايين) ان شاء الله \nوالمكان هيكون في قاعه الربع في شارع المعز- الحسين - القاهره القديمه\n\nطيب والتسجيل ؟؟؟\n\nده لينك التسجيل :\n \nhttp://goo.gl/0TrXEo","created_time":"2015-05-02T06:39:20+10:00","total_likes":1,"total_comments":0},{"id":"172338516139198_934668009906241","from":{"name":"Ahmed Faĥmŷ","id":"1384388628250242"},"message":"العدد الثانى من مجله Devmix :D","caption":"devmix.org","description":"  العدد الثانى من مجلة فريق DevMix نتمنى ان تنال اعجابكوا و نحقق لكم من خلالها اقصى استفاده ممكنه العدد الثانى :: عدد شهر ابريل 2015 تحميل المجلة هنستنى منكم تقيم المجلة بعد القراءه على الفورم...","created_time":"2015-05-02T06:55:01+10:00","total_likes":2,"total_comments":0},{"id":"172338516139198_934259696613739","from":{"name":"Mohammad Tayseer","id":"10154965677956341"},"message":"Leaflet Routing Machine is an easy, flexible and extensible way to add routing to a Leaflet map\n\nFeatures\n\n- Standard Leaflet control, with Leaflet look and feel\n- Routing from start to destination, with possibility of via points\n- Add, edit and remove waypoints through both address input and using the map\n- Multiple language support\n- Support for several routing engines","caption":"liedman.net","description":null,"created_time":"2015-05-01T06:58:11+10:00","total_likes":5,"total_comments":6},{"id":"172338516139198_934592836580425","from":{"name":"Osama Soliman","id":"709206249239999"},"message":"Just wondering ... what happens if two persons commented in the same time -same ms- or even smaller unit ? .... how facebook db or any other db will handle this ?","caption":null,"description":null,"created_time":"2015-05-02T03:12:19+10:00","total_likes":5,"total_comments":17},{"id":"172338516139198_934882456551463","from":{"name":"Ahmad Alfy","id":"10154097389365670"},"message":null,"caption":"youtube.com","description":"From Fluent 2015: Kyle Simpson is an Open Web Evangelist from Austin, TX, who’s passionate about all things JavaScript. He’s an author, workshop trainer, tec...","created_time":"2015-05-02T22:48:09+10:00","total_likes":2,"total_comments":0},{"id":"172338516139198_934992589873783","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":null,"caption":"medium.com","description":"Thirty thoughts about building startups","created_time":"2015-05-03T04:19:03+10:00","total_likes":0,"total_comments":0},{"id":"172338516139198_934993079873734","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":"+50 BUSINESS & REVENUE MODEL EXAMPLES","caption":"boardofinnovation.com","description":"How to select a new business model? We’ve handpicked dozens of remarkable revenue model examples. On this page you’ll find a free download of +50 cases.","created_time":"2015-05-03T04:20:12+10:00","total_likes":0,"total_comments":0},{"id":"172338516139198_934994023206973","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":null,"caption":"thinkapps.com","description":"Keeping an existing customer is much cheaper than acquiring a new customer. Here’s a guide to analyzing customer churn in order to improve retention.","created_time":"2015-05-03T04:23:35+10:00","total_likes":1,"total_comments":0}]}