{"posts":[{"id":"172338516139198_1090816567624717","from":{"name":"Mohamed Zeineldin","id":"10212399082202789"},"message":"Any ideas about an open-source SW/HW inventory tools rather than OCS-inventory also it can group the servers ?\n\nor even to make it with chef knife ?","caption":null,"description":null,"created_time":"2016-03-04T04:24:13+11:00","total_likes":0,"total_comments":0},{"id":"172338516139198_1090785960961111","from":{"name":"Islam Azab","id":"10154876688426014"},"message":"Hi,\n\nI use Pocket (https://getpocket.com/) a lot, and I really like it. Especially the listen-to-article feature on Android. I was wondering if there is something as good as it on chrome or any browser?\n\nI tried (SpeakIt!) but it is not good.\n\n\"It also pronounces words with apostrophes as separate units. Ex: \"John's car\" is pronounced as John? S car. Did I mention that some voices just randomly pause during a speech? Ugh.\"","caption":"getpocket.com","description":"When you find something you want to view later, put it in Pocket.","created_time":"2016-03-04T03:18:30+11:00","total_likes":3,"total_comments":3},{"id":"172338516139198_1090909980948709","from":{"name":"Mohamed Elsherif","id":"10158483817400314"},"message":"This quote reminded me with some suggestions people may give trying help, while they can make more damage than help with good intentions.","caption":"By Adam Shostack","description":"Quote shared via Kindle: \"Well, many of the building blocks just discussed are discretionary. You can use them well or you can use them poorly. It's up to you to ensure that you don't set the permissions on a file to 777,\"","created_time":"2016-03-04T07:39:38+11:00","total_likes":9,"total_comments":1},{"id":"172338516139198_1090954600944247","from":{"name":"Mohamad Emad","id":"1118459391596579"},"message":"FBI: افتحلي التليفون دا يا ابني \nApple:  يا باشا ولله ميصحش  \nFBI: افتح التليفون دة موضوع يخص الامن القومي \nApple: يا باشا لو انا عملتلك باك دور في هاكرز هيستخدموها\n-في منزل Bill gates -\nBill gates:  الله دا في فرصة اتخلص من منافس \n- bill gates يعقد مؤتمر صحفي -\nBill gates:  انا مع ال اف بي اي\n-بعد الDROWN attack -\nApple:  ياااااة كان زمان التليفون ضاع لو اديتة لل اف بي اي\nMacafee: استني عندك يا ابل احنا لسة مخلصناش \nApple: نعم \nMacafee: انا مستعد اكل جزمتي علي الهوا لو مفتحتش ال I phone\nApple : شييت\nو مازال الهبل مستمرا","caption":null,"description":null,"created_time":"2016-03-04T09:40:22+11:00","total_likes":3,"total_comments":1},{"id":"172338516139198_1091134570926250","from":{"name":"Tarek Amr","id":"10154871355735944"},"message":"I wrote this post about regressions analysis. I think you may find it useful.","caption":"medium.com","description":"Using Scikit-Learn and a little bit of Python","created_time":"2016-03-04T17:41:27+11:00","total_likes":8,"total_comments":2},{"id":"172338516139198_1091063977599976","from":{"name":"Ahmed Jadelrab","id":"1664976033803696"},"message":"What is the best hosting for personal use?\nFrom where to buy a domain is it better to buy it from the same hosting or from another service like name.com or other?\n\nI am looking for personal hosting to host a personal blog for me to write technical articles or anything it might interest me, Thanks in advance.","caption":null,"description":null,"created_time":"2016-03-04T13:57:57+11:00","total_likes":1,"total_comments":1},{"id":"172338516139198_1090585770981130","from":{"name":"George Leon","id":"10155084969830747"},"message":"لو سمحتم يا جماعة حد عنده اى خبرة فى التعامل مع الضرايب \nاو عنده فكرة عن طريقة تعامل الضرايب مع الفريلانسر","caption":null,"description":null,"created_time":"2016-03-03T18:54:23+11:00","total_likes":3,"total_comments":11},{"id":"172338516139198_1090280194345021","from":{"name":"Mohamed A. Othman","id":"1268007273278424"},"message":"أيه الخطوة إللي بعد تعلم أساسيات الـ JavaScript ومنين اجيب problems كتير أحلها ؟ ياريت تكون الأجابة مفصلة بخطوات أمشى عليها مايبقاش كلام عام، شكراً.","caption":null,"description":null,"created_time":"2016-03-03T04:43:05+11:00","total_likes":6,"total_comments":13},{"id":"172338516139198_1091289187577455","from":{"name":"Kareem Badawy","id":"1206517932798772"},"message":"don't miss it","caption":null,"description":"هتستفد ايه من حضور Imagine Cup Academy؟\n- هيكون فيه ناس متخصصين منهم ناس من Microsoft هيكلمو معاكو على حاجات كتير ممكن تكونو عايزين تعرفوها.\n-هيكون عندوكو الفرصة أنكو يكون ليكو Mentor  فى المشروع بتعكو ودة بيبقى شخص متخصص لكل فريق عشان يرشدو ويساعد ال فريق أنه ينجح. \n- موفرين ليكو المواصلات، buses الجامعة البريطانية هتوصلكو من مكان ما انتو سكنين  لحد باب الجامعة وترجعكو تاني كمان.\n-هتتعلمو حاجات كتير جديده…\n*المؤتمر ده لكل طلاب مصر وكل الجامعات!\n*التسجيل عن طريق اللينكات في-description بتاع الافنت وتابعو الصفحة لمعلومات \nأكتر: https://www.facebook.com/events/550986975082558\n\nWhat are the benefits of attending Imagine Cup Academy?\n-There will be a lot of experts and Microsoft Professionals to talk about many things that you might want to know.\n-You’ll get the chance to have a mentor to help you with your project that is dedicated to your team having a goal that is to help you Win the Imagine Cup competition.\n-Transportation will be provided by the BUE busses, will transport your from your home to the university and the opposite.\n-You’ll learn a lot more things…\n*The conference is open for Bueians and out comers too!\n*The registration is through the links provided in the description of the event, for more information check the event page: https://www.facebook.com/events/550986975082558\n\nShare and invite everyone!","created_time":"2016-03-05T00:20:45+11:00","total_likes":1,"total_comments":0},{"id":"172338516139198_1091180074255033","from":{"name":"Emad Elsaid","id":"10154379038212957"},"message":"فى هوجة لغات البرمجة الجديدة، واحد عامل لغة برمجة جديدة -واتمنى يكون عاملها تريقة- بتستخدم ال emojies كـ Keywords","caption":"emojicode.org","description":"Emojicode is an open source, high-level, multi-paradigm, object orientated programming language consisting of emojis.","created_time":"2016-03-04T19:54:48+11:00","total_likes":25,"total_comments":7}]}