{"posts":[{"id":"172338516139198_1358694087503629","from":{"name":"Mohammed Ezzat","id":"10209738059582902"},"message":"حد يقدر يفهمني يعني ايه الكلام ده ؟ \n\nUglify and minify your files. If you make changes in any file, Minification and Uglification have to be done automatically.","caption":null,"description":null,"created_time":"2017-01-19T14:09:52+11:00","total_likes":0,"total_comments":5},{"id":"172338516139198_1378222418884129","from":{"name":"Hazem Abdelraheem","id":"10211928046461151"},"message":"ماهى افضل شركة استضافة عربية من ناحية جودة الخدمة والدعم الفنى","caption":null,"description":null,"created_time":"2017-02-04T22:29:15+11:00","total_likes":0,"total_comments":5},{"id":"172338516139198_1377146158991755","from":{"name":"Hossam Mohammed","id":"1448877658497908"},"message":"I am making something like a search button for a website. the website is in Arabic so the search queries are all in Arabic. I want to make the queries work even if the searching string(title) wasn't identical to the searched one but had big similarity. like ابعاد سياسيه and أبعاد سياسية for example.\nI thought of making this using LIKE and wildcards.  but it won't work because I am comparing two strings not searching for a pattern of a one into the other so I though I can split the string into words and search for words as a pattern. but It seemed too complex and inaccurate.\nanother approach is to get all the records from the database and compare them to see how much they match up with my search text and if there was a one that highly matches I will get all the full row then. though I think it is very inefficient if the database got larger in size. I want to know if there is a little complex way to do it or if the query I mentioned above is fine.","caption":null,"description":null,"created_time":"2017-02-03T21:13:02+11:00","total_likes":4,"total_comments":10},{"id":"172338516139198_787996694573374","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":null,"caption":null,"description":null,"created_time":"2014-07-23T11:46:03+10:00","total_likes":25,"total_comments":4},{"id":"172338516139198_1377729115600126","from":{"name":"Ahmed Khaled","id":"1912422282377507"},"message":"hay everyone i love to share this tool with you :D \nHpta4Arms is a buggy tool used to spy on your friends it consists of 4 main arms as i love to call them :D those arms are working together to grap data from PC and send it via email\nFirst Arm : is Key logger that will save your key logs to a file called log.in\nSecond Arm : will take photo from your laptop camera and save it in a file called logg.png\nThird Arm : will detect your location using this API freegeoip.net\nFourth Arm : will package the last three arms and send them to your email address that you provided .\nGitHub : https://github.com/GardiansLab/Hpta4Arms\nWebsite : https://gardianslab.github.io/Hpta4Arms/","caption":"github.com","description":"Contribute to Hpta4Arms development by creating an account on GitHub.","created_time":"2017-02-04T09:01:06+11:00","total_likes":16,"total_comments":3},{"id":"172338516139198_1378644772175227","from":{"name":"Ali Abdel Samie","id":"769886583166318"},"message":"How and where I can find these books in Egypt: \nCracking the coding interview, Algorithms manual design, and Introduction to algorithms!\nThanks in advance.","caption":null,"description":null,"created_time":"2017-02-05T06:11:20+11:00","total_likes":3,"total_comments":8},{"id":"172338516139198_1380083758697995","from":{"name":"Ahmed M. Araby","id":"10154630737934263"},"message":"كنت بجرب امبارح دي علشان كنت بدور علي حاجه Acceptance testing بس تكون اسرع شوية من browsers العادية \nاسرع بكتير من اي حاجه تانية وكمان بتكتب كل ال tests شبه طريقة Codeception العادية\nمن جوه هو معتمد علي electron في الاساس","caption":"codecept.io","description":"Control browser in realtime with API of CodeceptJS. Click buttons, fill fields, try different locators inside a running test!","created_time":"2017-02-06T20:01:59+11:00","total_likes":13,"total_comments":1},{"id":"172338516139198_1380263458680025","from":{"name":"Omar Wagih","id":"1672065966426661"},"message":"Hello, Does anyone know how to copy a google spreadsheet from an api? \nI have a courses website and the tasks of each lesson must be done on a spreadsheet, i'm supplied with a sheet for each lesson, for each user i must copy that sheet, make him able to edit it and then submit it.","caption":null,"description":null,"created_time":"2017-02-07T00:38:42+11:00","total_likes":0,"total_comments":1},{"id":"172338516139198_1380342175338820","from":{"name":"Mohammad Alaggan","id":"10154136920322085"},"message":"They cracked the PRNG and were able to predict its future outputs.","caption":"wired.com","description":"Digging through slot machine source code helped a St. Petersburg-based syndicate make off with millions.","created_time":"2017-02-07T02:02:27+11:00","total_likes":12,"total_comments":0},{"id":"172338516139198_1380208718685499","from":{"name":"Mustafa Atta","id":"1340560486005628"},"message":"How do I verify a mobile number without using an SMS code based verification?","caption":null,"description":null,"created_time":"2017-02-06T23:07:12+11:00","total_likes":0,"total_comments":7}]}