{"posts":[{"id":"172338516139198_1324507800922258","from":{"name":"Mohammed Halim","id":"236433770151417"},"message":"hello \n\nما هو الافضل سيرفر قاعدة البيانات  remote vs local \nوهل يتأثر الموقع اذا كان remote  وكيف يمكن ان اشتري او احجز سيرفر على نفس الشبكة المتواجد فيها web server \nو ما هو رأيكم ب AWS - amazon web services","caption":null,"description":null,"created_time":"2016-12-13T03:55:38+11:00","total_likes":0,"total_comments":1},{"id":"172338516139198_1323692797670425","from":{"name":"Mohamed M Abdalbari","id":"487541354967310"},"message":"هو أنا لو عندى فكرة موقع كويسة، وعايز A raise fund عشان أشغل بروجرمرس وكده، أعمل أيه؟ أو أيه الخطوات اللى المفروض أخدها؟ ولو قررت أدخل مع مجموعة شركة أيه الخطوات اللى أخدها عشان أضمن حقوقى وأن الفكرة متتسرقش خصوصا أنها بسيطة وممكن تجيب بتاع عشرة عشرين ألف زائر مثلا فى الشهر. \nلو حد عنده مقالات أو لنكات أو حد يقدر يساعدنى ياريت يكلمنى، شكرًا ليكم.","caption":null,"description":null,"created_time":"2016-12-12T12:39:45+11:00","total_likes":2,"total_comments":9},{"id":"172338516139198_1322634927776212","from":{"name":"Youssef Saqr","id":"10154996968193428"},"message":"\"Request for Volunteers\"\nGood Morning Tech Community\nI've created the page (Scrach Edu Egypt) early 2015 for the sake of spreading the idea of Egyptian kids learn programming at home with this great tool created by MIT \"Scratch\", I also wanted the idea to reach as much schools as possible and this tool to be used by Computer teachers as a curriculum. \nI still have this dream that scratch gets used by millions of Egyptian kids as it is very easy to learn and use and all the materials and sample programs are there.\nThe page and idea is -Non Profit- and it will always be this way, the issue is I don't have much time to focus on the page and the idea and I want all those who believe on this cause (spreading the idea of programming for kids in Egypt) to help me in:\n1- Shaping a strategy on how to get Scratch known by everyone in Egypt through this page\n2- managing the page and adding contents on regular basis, answering parents who call and need guidance on how to start with their kids.\n3- spreading the word to schools to reach every school in Egypt who has computer curriculum.\n4- all and any other idea that can help to support this cause is very much welcomed\n\nIf you want to help, please message me on FB messenger","caption":null,"description":"الهدف من الصفحة أننا نوصل فكرة البرمجة للأطفال عن طريق لغة البرمجة سكراتش لأكبر عدد من الاباء و الاطفال و المدرسين في مصر","created_time":"2016-12-11T18:50:21+11:00","total_likes":16,"total_comments":4},{"id":"172338516139198_1325230634183308","from":{"name":"Abo Elleef","id":"10155065536739812"},"message":"https://zapier.com/learn/the-ultimate-guide-to-remote-working/","caption":"zapier.com","description":"Zapier makes it easy to automate tasks between web apps.","created_time":"2016-12-13T16:41:26+11:00","total_likes":1,"total_comments":0},{"id":"172338516139198_1325344517505253","from":{"name":"Ahmed Ali Ragheb","id":"10155128380108724"},"message":"If you are using Angular 2 and interested to know more about the journey of building it and how they improved it than Angular 1 \n\n","caption":"youtube.com","description":null,"created_time":"2016-12-13T19:06:43+11:00","total_likes":5,"total_comments":0},{"id":"172338516139198_1325455620827476","from":{"name":"Abdulla Adel Essa","id":"1475277042503657"},"message":"http://stackoverflow.com/research/developer-survey-2016","caption":"stackoverflow.com","description":"What do devs do. What do devs want. Read the results of the largest, most comprehensive developer survey ever conducted.","created_time":"2016-12-13T20:47:24+11:00","total_likes":1,"total_comments":0},{"id":"172338516139198_1325878584118513","from":{"name":"Ahmed Mahmoud","id":"1744998545829875"},"message":"السلام عليكم \nاي حد شغال في envato  وانا بكتب بيانات ال taxes طالب مني ال tax number \nرقم ضريبي خاص بيا عشان ميخصمش ضرايب مني اكتب ايه بالظبط ! \n\nانا كتبت بياناتي قبل كده وبرضه لسه بيعاملوني كمواطن امريكي وبيخصموا الضرايب ! حد عدي بالموضوع ده ؟","caption":null,"description":null,"created_time":"2016-12-14T04:15:36+11:00","total_likes":0,"total_comments":4},{"id":"172338516139198_1324913290881709","from":{"name":"Mohammed Agwa","id":"10210908866010995"},"message":"Dears, If any one using Ionic2 i have problem with native google maps multiple markers described here \n\nhttp://stackoverflow.com/questions/41112288/ionic2-native-map-multiple-markers\nor \nhttps://forum.ionicframework.com/t/native-map-markers-problem/72844 \n\ni searched a lot but all solutions uses pure javascript not typescript \nor Ionic-native classes. \nany help will be appreciated.","caption":"forum.ionicframework.com","description":"Hey all, I'm trying to implement native google maps in my ionic 2 project but i get an error to set markers clickable. this is my code to draw markers: for (var i = 0; i < mapMarkers.length; i++) { var centerMarker = mapMarkers[i]; let location = new GoogleMapsLatLng(centerMarker.lat, centerMarker.l...","created_time":"2016-12-13T11:43:33+11:00","total_likes":0,"total_comments":3},{"id":"172338516139198_1325500724156299","from":{"name":"Mohamed Nady","id":"10154387282503733"},"message":"Surfing the internet today and as a web developer always curious about what i see ,\nMicrosoft Ventures Web Site is built-up using Wordpress (PHP) https://microsoftventures.com \n#builtwith\n#microsoftPHP","caption":"microsoftventures.com","description":"Microsoft Ventures is an active, strategic partner at key stages of a startup's growth, typically investing between Series A and D.","created_time":"2016-12-13T21:46:24+11:00","total_likes":2,"total_comments":2},{"id":"172338516139198_1326528960720142","from":{"name":"Mohamed AbuIssa","id":"1364997500240454"},"message":null,"caption":null,"description":"\"The simplest place to start anchoring our measures is the circle marked \"13\" in the diagram, as the diameter runs from one point in the shape to another which makes it simple to create a circle of that precise size...\"","created_time":"2016-12-14T16:12:40+11:00","total_likes":1,"total_comments":0}]}