{"posts":[{"id":"172338516139198_976727505700291","from":{"name":"Hany Essam","id":"1342489319142943"},"message":"هو فيه فرق بين ال System analyst و ال business analyst\nو how to pursue a career as one of those ?\ni have a fair experience in Sales(Client Facing) and Programming.\nThanks in advance\nبردو if a presales role might be a good fit !?","caption":null,"description":null,"created_time":"2015-07-23T00:48:38+10:00","total_likes":1,"total_comments":3},{"id":"172338516139198_976378222401886","from":{"name":"Sameh Saeed","id":"10154266644607344"},"message":null,"caption":null,"description":"بعد أكثر من عام من النسخ التجريبية وتوقعات صدور النسخة النهائية، أصدرت Microsoft اليوم النسخة النهائية من Visual Studio IDE بالتزامن مع إطلاق تحديث لبيئة .NET.\n\nويمكنكم الاّن تحميل أو شراء النسخة الأخيرة عبر الموقع الرسمي من خلال الرابط التالي:\nhttp://www.syr-res.com/?1bb0\n\nولكن Team Foundation Server 2015 إحدى خدمات Microsoft للمطورين لن تكون متوفرة حتى الشهر القادم.\n\nوبحسب تصريحات Microsoft اليوم، فقد قامت الشركة بطرح العديد من الأدوات للتحميل، مثل نسخة Visual Studio Community المجانية والمحسنة للبرنامج الخاص بالأفراد، والتي تم تحميلها أكثر من 5 ملايين مرة اعتباراً من تاريخ إطلاقها منذ 7 شهور. كما قام أكثر من 3.2 مليون مطور بالتسجيل على خدمة Visual Studio Online.\n\nأما Visual Studio Code المحرر المستقل الخاص بالأكواد لكل من أنظمة Windows، وMac، وLinix فقد شهد أكثر من نصف مليون عملية تحميل اعتباراً من تاريخ إطلاقه منذ 3 شهور، علماً أن أكثر من نصف هذه التحميلات جاءت من قبل مستخدمي أنظمة Mac وLinux.\n\nوصرح \"Soma\" نائب رئيس قسم التطوير في شركة Microsoft أن هدف الشركة من النسخة الجديدة هو الإيفاء بالوعود المعطاة من ِقبل الشركة لجعل Visual Studio قابلاً للاستخدام على جميع منصات التشغيل الشعبية، وذلك بقوله: \"عندما تفكر في Visual Studio فإن الموضوع الأهم هو أنه قابل للاستخدام على مختلف الحواسيب ومختلف أنظمة التشغيل \"، وهو ما يعرف باسم Cross-platform، ويصيف: \"المطورون كانوا يطالبون بهذه الميزة وقد قدمناها لهم\".\n\nللقيام بهذا قام فريق Visual Studio بمحاكاة عمل Apache Cordova مثلاً، وذلك كي يتمكن المطورون من كتابة تطبيقات iOS وAndroid باستخدام كل من لغات HTML، وCSS، وJava Script. ويمكنهم أيضاً استخدام مهاراتهم في C++ لبناء مكونات مشتركة بين كل من iOS وAndroid وتطبيقات Windows.\n\nوبفضل شراكة Microsoft مع Xamarin، أصبح بإمكان المطورين أيضاً توجيه تطبيقاتهم المبرمجة باستخدام .NET نحو كل من iOS وAndroid. كما أن Visual Studio أصبح يتضمن محاكياً مضمناً به لنظام Android.\n\nإضافة إلى تعدد منصات التشغيل، فإن VS سيدعم كل من لغتي C# 6 وVB.NET 12، إضافة إلى تحسّن كبير في دعم لغات C++ وTypeScript وPython ، كما أن بعض الميزات الجديدة مثل Light Bulbs التي تعمل على تنبيه المطورين بالحلول المحتملة لأكوادهم بكل من لغتي C# و Visual Basic رأت النور بفضل مشروع Roslyn project مفتوح المصدر العام الماضي.\n\nوقد أكد Soma أيضاً أن المطورين أصبحوا يستطيعون استخدام مخدمات Windows وLinux كسحابات تخزينية لهم.\n\nيتضمن VS 2015 أيضاً العديد من أدوات التصحيح Debugging والتشخيص الجديدة والتي تم جمعها في أداة واحدة. إضافةً إلى العديد من التغيرات الكبيرة والصغيرة على حد سواء في النسخة الجديدة. علماً أن Microsoft قد قللت عدد الإصدارات من 3 إلى 2 هما Enterprise وPro، إضافة إلى إصدار Free Community Edition. كما أنها ستقدم نسخة مستقلة عديمة الاشتراك من VS Pro بسعر $499 فقط. \n\nأشار Soma أيضاً إلى أن ردة الفعل تجاه تغير هذه الأسعار كان إيجابياً بشكل عام خاصة بين مستخدمي نسخة VS Enterprise. كما قامت Microsoft، كجزء من فعالية اليوم، بالتعاون مع Humanitarian Toolbox لكتابة برنامج هدفه إفادة المجتمعات بعد حدوث الكوارث، وسيكون البرنامج متوفراً كمشروع مفتوح المصدر على GitHub اعتباراً من اليوم.\n\n====\n\nالمصدر: http://www.syr-res.com/?1bb1\nالترجمة: أسامة البغدادي\nالتدقيق: رشا سريو\nالصورة: أحمد صوفي","created_time":"2015-07-22T12:31:47+10:00","total_likes":7,"total_comments":5},{"id":"172338516139198_976945119011863","from":{"name":"Eyad Hossam","id":"786030198226134"},"message":null,"caption":null,"description":"عاوز تعرف ليه بيطلعلك اجابات مختلفة رغم انك بتستخدم نفس الأرقام؟ عمر نفس المشكلة قابلتك علي الcalculator بتاعك؟ اتعرف اكتر علي الorder of operations \\ ترتيب العمليات الحسابية من هنا: https://en.wikipedia.org/wiki/Order_of_operations\nاو شوف جدول ترتيب العمليات الحسابية (الطريق المختصر) من هنا: http://i.imgur.com/o2ToU6I.png","created_time":"2015-07-23T05:42:23+10:00","total_likes":0,"total_comments":3},{"id":"172338516139198_976782519028123","from":{"name":"Omar Mohsen","id":"1331663420227478"},"message":"https://justgetflux.com/","caption":"justgetflux.com","description":"Software to warm up your computer display at night, to match your indoor lighting.","created_time":"2015-07-23T02:36:15+10:00","total_likes":8,"total_comments":5},{"id":"172338516139198_976933795679662","from":{"name":"Mohammed El Sayed","id":"10154884040390170"},"message":"زي ما أغلبنا من مبرمجي ال .NET عرف, مايكروسوف أصدرت النسخه النهائيه من Visual Studio 2015.\nدي ال keynote بتاعة إصدار النسخه النهائيه مدتها ساعه و 44 دقيقه وبتغطي نقط كتير من اللى تم تحديثها أو إستحداثها فى النسخه الجديده.\nكمان بيتكلم بشكل موجز عن إزاى تعمل Cross-Platform apps بإستخدام \nVisual Studio.\n\nمشاهده ممتعه :)","caption":"channel9.msdn.com","description":"This keynote will provide a great overview packed with demos for you to get started with Visual Studio 2015, .NET 4.6 and Visual Studio Online. See how these big releases will increase your productivi","created_time":"2015-07-23T05:16:38+10:00","total_likes":25,"total_comments":2},{"id":"172338516139198_977054695667572","from":{"name":"Roshdy Abuzeid","id":"10208732910143859"},"message":"SharePoint 2013 issue.. \nWhen adding new updated file version to style library,  still see the old version!! \nAnyone face this issue before?","caption":null,"description":null,"created_time":"2015-07-23T10:23:39+10:00","total_likes":0,"total_comments":2},{"id":"172338516139198_977677308938644","from":{"name":"Abd ElRahman Ahmad","id":"1805323669794050"},"message":"اولى اعمالى على موقع تصميمي ,\nقالب \"Calm\" الاحترافى المستجيب ,\nقالب بسيط يتكون من صفحة واحده , صاحب التصميم \"الاستاذ/صلاح الامام\" تم التكويد بواسطتى , الصور الموجوده هى مابعد التكويد , التصميم فلات ومستجيب بالكامل .\n-\nhttps://www.facebook.com/1444631795863241\nLike & share <3\n-","caption":"tasmeemme.com","description":"قالب بسيط يتكون من صفحة واحده , صاحب التصميم \"الاستاذ/صلاح الامام\" تم التكويد بواسطتى , الصور الموجوده هى مابعد التكويد , التصميم فلات ومستجيب بالكامل ","created_time":"2015-07-24T01:30:22+10:00","total_likes":4,"total_comments":0},{"id":"172338516139198_977739388932436","from":{"name":"Ahmed Ayman Aladeeb","id":"965840623552738"},"message":"السلام عليكم، حد جرّب يستضيف Opencart على Hostgator ! هل واجهته مشاكل ولا لا ؟ ، وياريت Recommendation  لأفضل Host بتSupport الOpencart عن تجربة.","caption":null,"description":null,"created_time":"2015-07-24T04:21:43+10:00","total_likes":1,"total_comments":1},{"id":"172338516139198_977041522335556","from":{"name":"Sherif El-Melegy","id":"2249925261898253"},"message":"Hi Guys\nThere One thief is really really annoying me with my Wireless Network\ni Don't Know How he get my password even i Made ((Mac Address Filter)) with the router :( \nHow i Stop this Shit :( :(","caption":null,"description":null,"created_time":"2015-07-23T09:32:39+10:00","total_likes":0,"total_comments":25},{"id":"172338516139198_977760965596945","from":{"name":"Mohamed Atef Abd ElWahab","id":"10155220916862048"},"message":"Anyone have experience with phonegap. I want to make connection to a remote mysql database using asp.Net web api any help?","caption":"asp.Net","description":"ASP.NET is a free web framework for building great Web sites and Web applications using HTML, CSS and JavaScript.","created_time":"2015-07-24T05:33:33+10:00","total_likes":1,"total_comments":9}]}