{"posts":[{"id":"172338516139198_1266807930025579","from":{"name":"Ahmed Thabet","id":"1447976585214974"},"message":"كتبت GithubFuse Filesystem \nhttps://github.com/xmonader/githubfuse\nقولولي رأيكم (حاليا بفكر اضيف ميزة لل branch/tag في اسم ال  directory )","caption":null,"description":null,"created_time":"2016-10-24T05:37:34+11:00","total_likes":7,"total_comments":3},{"id":"172338516139198_1266495090056863","from":{"name":"Muhammad Negm","id":"10212131509466411"},"message":"For non-embedded engineers.\nHave you written anything before in C/CPP in your company ?","caption":null,"description":null,"created_time":"2016-10-23T22:11:39+11:00","total_likes":4,"total_comments":20},{"id":"172338516139198_1266085433431162","from":{"name":"Ehab Ragab","id":"1253784504670216"},"message":"معرفش المعلومة دي جديدة بالنسبالي انا بس ولا ايه :\"D","caption":"techworm.net","description":"Everyone who uses a lot of Chrome tabs could use this neat little trick to free up memory Everyone who likes Chrome including me, often keep several tabs o","created_time":"2016-10-23T11:14:30+11:00","total_likes":7,"total_comments":4},{"id":"172338516139198_1267229819983390","from":{"name":"Alaa Ali","id":"10154999548701303"},"message":"Hello geeks,\n\nDoes anyone know companies in cairo that do SAP consultancy/implementations?","caption":null,"description":null,"created_time":"2016-10-24T18:52:59+11:00","total_likes":1,"total_comments":8},{"id":"172338516139198_1266959316677107","from":{"name":"Mohammed El Sayed","id":"10154884040390170"},"message":"مبروك للجروب الوصول إلي 10000 مشترك.\nالجروب بفضل مجهوداتكم وصل للعدد دا من المشتركين (ال geeks :) ) ودا إنجاز نعتز بيه ونتمنى استمرار الجروب فى تقديم محتوي راقي يليق بمجتمع ال geeks المنضم لينا.\nشكراً لكل مساهمة ولكل رأي ولكل إجابة على سؤال.\nنتمني إستمرار مستوي الأسئله والمناقشات على نفس القدر من الإحترافيه اللى بيحاول رواد الجروب المحافضه عليه ونرتقي بيه كمان لمستويات أفضل ومن نجاح لنجاح بإذن الله :)","caption":null,"description":null,"created_time":"2016-10-24T09:58:10+11:00","total_likes":25,"total_comments":2},{"id":"172338516139198_1267659213273784","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":"First they try to steal the business model of Netflix and now their top Infrastructure guys :)","caption":"allthingsdistributed.com","description":"I am excited that Adrian Cockcroft will be joining AWS as VP of Cloud Architecture. Adrian has played a crucial role in developing the cloud ecosystem as Cloud Architect at Netflix and later as a Technology Fellow at Battery Ventures. Prior to this, he held positions as Distinguished Engineer at eBa...","created_time":"2016-10-25T06:45:47+11:00","total_likes":9,"total_comments":0},{"id":"172338516139198_1267687303270975","from":{"name":"HaDy ElsWah","id":"10211164387979898"},"message":"لو سمحتوا\nعاوز اعمل marc format\nو doublin core  format  ل اى كتاب   ومش لاقى اى حاجه على النت الصراحه حد يعرف يساعدنى","caption":null,"description":null,"created_time":"2016-10-25T07:19:39+11:00","total_likes":0,"total_comments":0},{"id":"172338516139198_1267694766603562","from":{"name":"Amir Abou Eesa","id":"1353018234756623"},"message":"عندنا دلوقتي عدد مهول من الاجهزه الonline الي الfirmware بتاعها مش هيسمح بايremote updates وكلهم مفيهومش اي حمايه ... ارض الزومبيز.","caption":"thehackernews.com","description":"Chinese Electronics Firm Hangzhou Xiongmai Technology to recall its vulnerable smart products whose Internet connected cameras were hacked by Mirai botnet to take down the Internet with massive ddos attack.","created_time":"2016-10-25T07:29:41+11:00","total_likes":3,"total_comments":0},{"id":"172338516139198_1267773109929061","from":{"name":"Hany Ahmed","id":"10155057984387292"},"message":null,"caption":null,"description":"الكابتشا CAPTCHA\nهي اختصار لجملة طويلة شوية\nCompletely Automated Public Turing test to tell Computers and Humans Apart\nيعني اختبار تورينج العام - الأوتوماتيكي بشكل كامل - للتفرقة بين البشر والحواسب\n\nاختبار تورينج تم وضعه عام 1950 بواسطة عالم الرياضيات آلان تورينج, الاختبار دا بيستخدم للتفرقة بين الانسان والآلة\n\nطب هو ايه المشكلة أصلاً ؟\nالمشكلة كانت ان فيه برمجيات صغيرة Robots/bots كانت بتدخل على المواقع وبتتصرف كأنها انسان عادي, فممكن الروبوت دا يدخل على موقع بريد الكتروني ويعمل آلاف الحسابات الوهمية في شوية دقائق\nفكان لازم لموقع الويب اللي عليه فورم بيتملى فيها بيانات انها تتأكد ان كاتب البيانات دي عبارة عن انسان مش روبوت\n\nفكانت الفكرة ان يتم وضع صورة لكلمة معينة ولازم المستخدم يدخل نفس الكلمة\nبس المشكلة ان الحاسب ممكن يتعرف على نصوص كاملة من الكلمات باستخدام تقنية التعرف على الحروف Optical Character Recognition (OCR)\nفكان لازم الكابتشا تعرض صورة لمجموعة من الحروف الغير واضحة بوضع تأثير زي ان الحروف فيها ميل او تموج او وراها خلفية\nالحاجات دي كلها بتخلي التعرف على الحروف صعب من جهة الحاسب\n\nGoogle reCAPTCHA\nhttps://www.google.com/recaptcha/intro/index.html\n\nدا النظام اللي استحوذت عليه جوجل في 2009\nهو زود الصعوبة بإنه بيدمج الحروف مع بعضها ودا بيخلي الكمبيوتر - اللي بيفرق الحروف عن بعضها بالمسافات البينية - غير قادر على تحديد الحروف\nكمان بيحط خط بعرض الكلمات بيزيد من صعوبة التعرف على الحروف\nكمان هو بدأ يستخدم حلول تانية زي انه يعرض مجموعة صور ويطلب منك انك تختار شوية صور منها بتحتوي على أشجار مثلاً\n\nكمان النظام دا فايدته الانسانية عظيمة جداً في انه قدر يحول الأرشيف الورقي لمجلة التايمز - 13 مليون مقالة - لوثائق الكترونية\nالنظام عمل الموضوع دا بطريقة عبقرية بأنه كان بيعرض كلمتين واحدة منهم هو عارفها وهو اللي بيتأكد منها انك انسان وواحدة تانية كلمة معمولها سكان من الجريدة\nوطبعا المستخدم اللي بيدخل الكابتشا مش عارف أي كلمة هي المفروض يكتبها صح فكان بيكتب الكلمتين صح ومنها جمع كل كلمات مقالات التايمز وحولها لوثائق الكترونية","created_time":"2016-10-25T08:59:05+11:00","total_likes":8,"total_comments":1},{"id":"172338516139198_1267874213252284","from":{"name":"Ibrahim Sobh","id":"10154358640302967"},"message":"https://www.linkedin.com/pulse/deep-learning-artistic-style-algorithm-ibrahim-sobh","caption":"linkedin.com","description":"Introduction: Here we introduce an artiﬁcial system based on a Deep Neural Network that creates artistic images of high perceptual quality. The system uses neural representations to separate and","created_time":"2016-10-25T11:43:10+11:00","total_likes":0,"total_comments":0}]}