{"posts":[{"id":"172338516139198_1128881800484860","from":{"name":"Ahmed Mohamed Kamal","id":"10211992239782935"},"message":"no more dependencies hell ? \n\n\"Snap packages can (though don’t have to) contain both application binary and any dependencies required for it to run. Yup, even if those libraries are already installed on the host system.\n...\nApplications packaged in the format are isolated from the rest of the system. You can install a snappy package without worrying about what it might do to other software you have installed.\"","caption":"omgubuntu.co.uk","description":"Ubuntu 16.04 LTS will come with support for Canonical's (relatively new) Snap packaging format.","created_time":"2016-04-21T23:00:51+10:00","total_likes":4,"total_comments":1},{"id":"172338516139198_1127611497278557","from":{"name":"Ahmed Kh'aled","id":"1340434959359755"},"message":"كنت عايز أكتب برنامج بالجافا client-server وعايزه يستكشف الشبكة (ياعني يعرف لو كان ف نسخة من البرنامج ده موجوده على جهاز تاني ف الشبكة ولا لأ) دورت ولاقيت إن في حلين  - تقريباً ياعني - واحد فيهم إني أستخدم MulticastSocket والحل التاني إني أستخدم broadcast IP 255.255.255.255 ف السؤال هنا ياعني هو إيه الفرق بين الإتنين؟ وأنهو الأنسب؟ وهل في حلول تانية بسيطة ولا ﻷ؟ شكراً مقدماً.","caption":null,"description":null,"created_time":"2016-04-20T06:21:53+10:00","total_likes":4,"total_comments":4},{"id":"172338516139198_1129436443762729","from":{"name":"Mustafa Dagher","id":"10212394020589663"},"message":null,"caption":"www.smashingmagazine.com","description":"JavaScript is a wonderful language. It’s rich, it’s dynamic, and it’s so tightly coupled to the web nowadays. The concept of writing everything in JavaScript doesn’t sound so crazy anymore. First, we started writing our back end in JavaScript, and then Facebook introduced JSX, in which we mix HTML m…","created_time":"2016-04-22T18:30:34+10:00","total_likes":24,"total_comments":8},{"id":"172338516139198_1129146917125015","from":{"name":"Nabeel Molham","id":"10211673678738309"},"message":"If anyone has #WordPress #development related #question, just mention me and I would be happy for help, thanks","caption":null,"description":null,"created_time":"2016-04-22T06:10:14+10:00","total_likes":6,"total_comments":1},{"id":"172338516139198_1127507817288925","from":{"name":"Ahmed Essam","id":"1851508841788910"},"message":"Do you Remember the Hacking Team breach? The security company that sells spy tools to governments including Egypt and got hacked. \nThe hacker who made the breach and posted 400gb of its mail and data on the internet has made a detailed write-up about how he hacked the company. He even included links in his write-up about the tools he used. \nThe first write-up was written in Spanish then he released the translation in English.\nhttp://motherboard.vice.com/read/hacking-team-ceo-bashes-sensationalist-media-and-vigilante-hacker\n\nThe long and detailed write-up in English: http://pastebin.com/raw/0SNSvyjJ","caption":"motherboard.vice.com","description":"The surveillance company reacts after the vigilante hacker Phineas Fisher explained how he broke into its servers.","created_time":"2016-04-20T03:44:21+10:00","total_likes":16,"total_comments":5},{"id":"172338516139198_1129220080451032","from":{"name":"Mohamed Abdel Aty","id":"10212491964880718"},"message":"NO ONE IS SAFE \n\n","caption":"devco.re","description":"Bug Bounty Hunting from Pentest View, and How to Find Remote Code Execution and Someone's Backdoor on Facebook Server...","created_time":"2016-04-22T09:37:40+10:00","total_likes":9,"total_comments":1},{"id":"172338516139198_1126287590744281","from":{"name":"Rafael Adel","id":"10155242150027122"},"message":"مساء الخير\nمعلش انا حاسس اني سألت السؤال ده كتير بس انا فى حيرة شوية فى اختيار المجال اللى ليه سوق عمل و فى نفس الوقت اكون متقبله نسبيا شوية \nانا كنت شغال Web developer لمدة سنتين تقريبا.. بس فى السنتين دول اكتشفت ان الويب كمواقع بقي و html و حاجات custom websites تتعمل .. ده مش ليا و مش بحب فعلا اشتغل فيه ... انا حابب اكتر الحاجة اللى more low level او more analytical اللي بستخدم فيها العلم فعلا سواء رياضة او algorithms مثلا و اقدر استخدم البرمجة عشان اطلع بحل لمشكلة معينة غير اني اعمل ويب سايت.. فدخلت طريق ال embedded مشيت فيه و خدت كورس بس للاسف محدش لسة اتكلم معرفش ده لاني مفيش خبرة ولا عشان مش خريج هندسة مثلا (انا خريج علوم) .. فاثناء ما انا مستني كنت برضو بذاكر اكتر math و هخش اكتر برضو فى algorithms & data structure عشان عايز اعلي من نفسي فى العلم نفسه مش مجرد عارف كام technology و خلاص..\nفدلوقتي انا من كتر ما مركز فى الحاجات دى بعدت عن ال embedded و حسيت اني بفقد اهتمامي فيه مع الوقت .. فانا سؤالي عشان مش عارف اعمل ايه بصراحة :\nاستني افضل ابعت فى ال embedded و احاول اخش اكتر فى المجال .. ولا امشي بالتوازى مع اللى بذاكره و اخش java او c++ ؟؟ انا ميال اكتر لل Cpp .. بس بدور علي فرص الشغل هنا . يعتبر مفيش فعلا .. ففكرت لو Java هيكون ايه غير الويب و الموبايل ؟؟ فانا مش عارف اعمل ايه فى المعضلة اللى انا فيها :D \nاسف على الاطالة .. لو سؤالي عايم شوية ياريت تقولولي و احاول اوضحة اكتر \nشكرا","caption":null,"description":null,"created_time":"2016-04-18T07:50:24+10:00","total_likes":7,"total_comments":10},{"id":"172338516139198_1129870133719360","from":{"name":"Ahmad Abdel-Halim","id":"1933903146842707"},"message":"Is there's any decent group on Facebook for ruby developers?","caption":null,"description":null,"created_time":"2016-04-23T10:12:22+10:00","total_likes":2,"total_comments":1},{"id":"172338516139198_1129985400374500","from":{"name":"Mohamed Abdel Aty","id":"10212491964880718"},"message":"am just leaving you here with this part of a recent report by a bug hunter who was trying to hack a Facebook server only to find that it have a backdoor installed already\n\nshouldn't Facebook respond to this already ?\n\nthe report : http://devco.re/blog/2016/04/21/how-I-hacked-facebook-and-found-someones-backdoor-script-eng-ver/","caption":null,"description":null,"created_time":"2016-04-23T15:05:59+10:00","total_likes":0,"total_comments":2},{"id":"172338516139198_1129634750409565","from":{"name":"Mohamed Fergany","id":"10212218310718439"},"message":"احنا مركبين Logwatch علي سيرفر المفروض انه بيبعت ريبورت يومي بمحاولات ال Login وريبورت كامل عن ايه الي بيحصل بشكل كامل . \n\nوصلني ريبورت ب محاولات دخول كتير ك Root علي السيرفر \nيعني مثلا النهارده . محاوالات دخول  من 106 IP مختلفين عدد المحاولات 306 مرة . \n\nهل دا طبيعي ولا ايه لاني حاسس اني فيه حاجة غلط . \nهل الناس الي عندها سيرفرات متعودة علي حاجة زي كدا ؟","caption":null,"description":null,"created_time":"2016-04-23T01:45:27+10:00","total_likes":16,"total_comments":11}]}